	/**
	 * 테스트 유무1
	 */
	var isTest = false;
	
	var last_click_time = new Date().getTime();
	
	// LSC 코드 DB버전
	// 1.0 : 2015-06-18
	// 1.1 : 2015-06-23
	// 1.2 : 2015-07-13
	// 1.3 : 2015-07-16 (좌표값 추가)
	// 1.4 : 2015-07-22 (지역 주소 세밀하게 갱신)
	// 1.5 : 2016-04-13 (전남 구례 5센터 추가)
	var lscVer = '1.5'; 
	
	function runDB(){
		var lcsVerCookie = getAlopexCookie('lscDB_Ver');
		if(getAlopexCookie('lscDB') == 'undefined' || lcsVerCookie != lscVer){
			var ss = [{'lsc':'B066', 'center':'과천 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'과천시', 'dong':'전역', 'tel' : '02-502-2047'}
			,{'lsc':'B092', 'center':'광주 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'광주시', 'dong':'경안동', 'tel' : '031-765-0967'}
			,{'lsc':'B092', 'center':'광주 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'광주시', 'dong':'곤지암읍', 'tel' : '031-765-0967'}
			,{'lsc':'B092', 'center':'광주 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'광주시', 'dong':'도척면', 'tel' : '031-765-0967'}
			,{'lsc':'B090', 'center':'광주 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'광주시', 'dong':'목현동', 'tel' : '031-765-0643'}
			,{'lsc':'B090', 'center':'광주 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'광주시', 'dong':'삼동', 'tel' : '031-765-0643'}
			,{'lsc':'B092', 'center':'광주 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'광주시', 'dong':'송정동', 'tel' : '031-765-0967'}
			,{'lsc':'B092', 'center':'광주 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'광주시', 'dong':'쌍령동', 'tel' : '031-765-0967'}
			,{'lsc':'B092', 'center':'광주 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'광주시', 'dong':'역동', 'tel' : '031-765-0967'}
			,{'lsc':'B090', 'center':'광주 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'광주시', 'dong':'오포읍', 'tel' : '031-765-0643'}
			,{'lsc':'B090', 'center':'광주 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'광주시', 'dong':'장지동', 'tel' : '031-765-0643'}
			,{'lsc':'B090', 'center':'광주 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'광주시', 'dong':'중대동', 'tel' : '031-765-0643'}
			,{'lsc':'B092', 'center':'광주 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'광주시', 'dong':'초월읍', 'tel' : '031-765-0967'}
			,{'lsc':'B090', 'center':'광주 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'광주시', 'dong':'탄벌동', 'tel' : '031-765-0643'}
			,{'lsc':'B090', 'center':'광주 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'광주시', 'dong':'태전동', 'tel' : '031-765-0643'}
			,{'lsc':'B092', 'center':'광주 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'광주시', 'dong':'퇴촌면', 'tel' : '031-765-0967'}
			,{'lsc':'B090', 'center':'광주 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'광주시', 'dong':'회덕동', 'tel' : '031-765-0643'}
			,{'lsc':'B064', 'center':'분당 4 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'구미동', 'tel' : '031-713-2271'}
			,{'lsc':'B064', 'center':'분당 4 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'구미1동', 'tel' : '031-713-2271'}
			,{'lsc':'B064', 'center':'분당 4 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'궁내동', 'tel' : '031-713-2271'}
			,{'lsc':'B064', 'center':'분당 4 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'금곡동', 'tel' : '031-713-2271'}
			,{'lsc':'B063', 'center':'분당 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'대장동', 'tel' : '031-711-4452'}
			,{'lsc':'B064', 'center':'분당 4 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'동원동', 'tel' : '031-713-2271'}
			,{'lsc':'B063', 'center':'분당 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'백현동', 'tel' : '031-711-4452'}
			,{'lsc':'B063', 'center':'분당 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'분당동', 'tel' : '031-711-4452'}
			,{'lsc':'B061', 'center':'분당 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'삼평동', 'tel' : '031-705-1108'}
			,{'lsc':'B063', 'center':'분당 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'서현2동', 'tel' : '031-711-4452'}
			,{'lsc':'B061', 'center':'분당 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'서현1동', 'tel' : '031-705-1108'}
			,{'lsc':'B063', 'center':'분당 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'석운동', 'tel' : '031-711-4452'}
			,{'lsc':'B063', 'center':'분당 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'수내동', 'tel' : '031-711-4452'}
			,{'lsc':'B061', 'center':'분당 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'야탑동', 'tel' : '031-705-1108'}
			,{'lsc':'B063', 'center':'분당 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'운중동', 'tel' : '031-711-4452'}
			,{'lsc':'B061', 'center':'분당 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'율동', 'tel' : '031-705-1108'}
			,{'lsc':'B061', 'center':'분당 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'이매동', 'tel' : '031-705-1108'}
			,{'lsc':'B063', 'center':'분당 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'정자2동 (101~117)', 'tel' : '031-711-4452'}
			,{'lsc':'B064', 'center':'분당 4 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'정자1,3동', 'tel' : '031-713-2271'}
			,{'lsc':'B063', 'center':'분당 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'판교동', 'tel' : '031-711-4452'}
			,{'lsc':'B063', 'center':'분당 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 분당구', 'dong':'하산운동', 'tel' : '031-711-4452'}
			,{'lsc':'B053', 'center':'성남 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 수정구', 'dong':'고등동', 'tel' : '031-754-4541'}
			,{'lsc':'B053', 'center':'성남 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 수정구', 'dong':'금토동', 'tel' : '031-754-4541'}
			,{'lsc':'B052', 'center':'성남 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 수정구', 'dong':'단대동', 'tel' : '031-757-7005'}
			,{'lsc':'B052', 'center':'성남 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 수정구', 'dong':'복정동', 'tel' : '031-757-7005'}
			,{'lsc':'B053', 'center':'성남 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 수정구', 'dong':'사송동', 'tel' : '031-754-4541'}
			,{'lsc':'B052', 'center':'성남 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 수정구', 'dong':'산성동', 'tel' : '031-757-7005'}
			,{'lsc':'B053', 'center':'성남 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 수정구', 'dong':'수진동', 'tel' : '031-754-4541'}
			,{'lsc':'B053', 'center':'성남 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 수정구', 'dong':'시흥동', 'tel' : '031-754-4541'}
			,{'lsc':'B052', 'center':'성남 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 수정구', 'dong':'신촌동', 'tel' : '031-757-7005'}
			,{'lsc':'B052', 'center':'성남 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 수정구', 'dong':'신흥동', 'tel' : '031-757-7005'}
			,{'lsc':'B052', 'center':'성남 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 수정구', 'dong':'심곡동', 'tel' : '031-757-7005'}
			,{'lsc':'B056', 'center':'성남 6 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 수정구', 'dong':'양지동', 'tel' : '031-732-4655'}
			,{'lsc':'B052', 'center':'성남 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 수정구', 'dong':'오야동', 'tel' : '031-757-7005'}
			,{'lsc':'B052', 'center':'성남 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 수정구', 'dong':'창곡동', 'tel' : '031-757-7005'}
			,{'lsc':'B052', 'center':'성남 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 수정구', 'dong':'태평동', 'tel' : '031-757-7005'}
			,{'lsc':'B056', 'center':'성남 6 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 중원구', 'dong':'금광동', 'tel' : '031-732-4655'}
			,{'lsc':'B057', 'center':'성남 7 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 중원구', 'dong':'도촌동(여수동제외)', 'tel' : '031-731-1261'}
			,{'lsc':'B057', 'center':'성남 7 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 중원구', 'dong':'상대원동', 'tel' : '031-731-1261'}
			,{'lsc':'B053', 'center':'성남 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 중원구', 'dong':'성남동', 'tel' : '031-754-4541'}
			,{'lsc':'B053', 'center':'성남 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 중원구', 'dong':'여수동', 'tel' : '031-754-4541'}
			,{'lsc':'B056', 'center':'성남 6 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 중원구', 'dong':'은행동', 'tel' : '031-732-4655'}
			,{'lsc':'B057', 'center':'성남 7 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 중원구', 'dong':'중앙동 (3~676, 1436~2592)', 'tel' : '031-731-1261'}
			,{'lsc':'B052', 'center':'성남 2 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 중원구', 'dong':'중앙동 (681~1370, 2594~3748)', 'tel' : '031-757-7005'}
			,{'lsc':'B053', 'center':'성남 3 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'성남시 중원구', 'dong':'하대원동', 'tel' : '031-754-4541'}
			,{'lsc':'B081', 'center':'여주 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'여주시', 'dong':'전역', 'tel' : '031-885-0451'}
			,{'lsc':'B081', 'center':'여주 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'이천시', 'dong':'부발읍 응암리', 'tel' : '031-885-0451'}
			,{'lsc':'B081', 'center':'여주 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'이천시', 'dong':'설성면', 'tel' : '031-885-0451'}
			,{'lsc':'B081', 'center':'여주 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'이천시', 'dong':'장호원읍', 'tel' : '031-885-0451'}
			,{'lsc':'B080', 'center':'이천 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'이천시', 'dong':'전역 (부발읍 응암리, 장호원읍, 설성면 제외)', 'tel' : '031-637-8146'}
			,{'lsc':'B091', 'center':'송파 7 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'하남시', 'dong':'감북동(학암동)', 'tel' : '02-449-8871'}
			,{'lsc':'B070', 'center':'하남 1 서비스센터', 'bpname':'코원에너지서비스','city':'경기도', 'sigungu':'하남시', 'dong':'전역(감북동제외)', 'tel' : '031-794-8475'}
			,{'lsc':'B020', 'center':'강남 10 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'개포2동', 'tel' : '02-2226-5821'}
			,{'lsc':'B003', 'center':'서초 3 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'개포동', 'tel' : '02-572-7120'}
			,{'lsc':'B011', 'center':'강남 1 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'논현1동', 'tel' : '02-3442-0341'}
			,{'lsc':'B014', 'center':'강남 4 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'논현2동', 'tel' : '02-547-0083'}
			,{'lsc':'B016', 'center':'강남 6 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'대치1,2,4동', 'tel' : '02-538-1824'}
			,{'lsc':'B003', 'center':'서초 3 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'도곡동', 'tel' : '02-572-7120'}
			,{'lsc':'B016', 'center':'강남 6 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'삼성1동', 'tel' : '02-538-1824'}
			,{'lsc':'B014', 'center':'강남 4 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'삼성2동', 'tel' : '02-547-0083'}
			,{'lsc':'B020', 'center':'강남 10 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'세곡동', 'tel' : '02-2226-5821'}
			,{'lsc':'B020', 'center':'강남 10 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'수서동', 'tel' : '02-2226-5821'}
			,{'lsc':'B011', 'center':'강남 1 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'신사동', 'tel' : '02-3442-0341'}
			,{'lsc':'B011', 'center':'강남 1 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'압구정동', 'tel' : '02-3442-0341'}
			,{'lsc':'B014', 'center':'강남 4 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'역삼1동 (789~799, 832~840 제외)', 'tel' : '02-547-0083'}
			,{'lsc':'B003', 'center':'서초 3 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'역삼1동 (789~799, 832~840)', 'tel' : '02-572-7120'}
			,{'lsc':'B014', 'center':'강남 4 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'역삼2동', 'tel' : '02-547-0083'}
			,{'lsc':'B020', 'center':'강남 10 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'일원1,2동', 'tel' : '02-2226-5821'}
			,{'lsc':'B020', 'center':'강남 10 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'일원본동', 'tel' : '02-2226-5821'}
			,{'lsc':'B014', 'center':'강남 4 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강남구', 'dong':'청담동', 'tel' : '02-547-0083'}
			,{'lsc':'B044', 'center':'강동 4 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강동구', 'dong':'강일동', 'tel' : '02-426-1405'}
			,{'lsc':'B044', 'center':'강동 4 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강동구', 'dong':'고덕동', 'tel' : '02-426-1405'}
			,{'lsc':'B047', 'center':'강동 7 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강동구', 'dong':'길동', 'tel' : '02-476-0675'}
			,{'lsc':'B046', 'center':'강동 6 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강동구', 'dong':'둔촌1동', 'tel' : '02-470-4283'}
			,{'lsc':'B047', 'center':'강동 7 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강동구', 'dong':'둔촌2동', 'tel' : '02-476-0675'}
			,{'lsc':'B045', 'center':'강동 5 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강동구', 'dong':'명일1동', 'tel' : '02-477-7792'}
			,{'lsc':'B044', 'center':'강동 4 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강동구', 'dong':'명일2동', 'tel' : '02-426-1405'}
			,{'lsc':'B044', 'center':'강동 4 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강동구', 'dong':'상일동', 'tel' : '02-426-1405'}
			,{'lsc':'B046', 'center':'강동 6 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강동구', 'dong':'성내동', 'tel' : '02-470-4283'}
			,{'lsc':'B045', 'center':'강동 5 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강동구', 'dong':'암사동', 'tel' : '02-477-7792'}
			,{'lsc':'B045', 'center':'강동 5 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강동구', 'dong':'천호1동 (39~50 제외)', 'tel' : '02-477-7792'}
			,{'lsc':'B047', 'center':'강동 7 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강동구', 'dong':'천호1동 (39~50)', 'tel' : '02-476-0675'}
			,{'lsc':'B045', 'center':'강동 5 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강동구', 'dong':'천호2동', 'tel' : '02-477-7792'}
			,{'lsc':'B047', 'center':'강동 7 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강동구', 'dong':'천호3동 (51~55)', 'tel' : '02-476-0675'}
			,{'lsc':'B045', 'center':'강동 5 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'강동구', 'dong':'천호3동 (51~55제외)', 'tel' : '02-477-7792'}
			,{'lsc':'B003', 'center':'서초 3 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'서초구', 'dong':'내곡동', 'tel' : '02-572-7120'}
			,{'lsc':'B001', 'center':'서초 1 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'서초구', 'dong':'반포1,2,3,4동', 'tel' : '02-512-2861'}
			,{'lsc':'B003', 'center':'서초 3 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'서초구', 'dong':'서초1,2,3동', 'tel' : '02-572-7120'}
			,{'lsc':'B001', 'center':'서초 1 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'서초구', 'dong':'서초4동', 'tel' : '02-512-2861'}
			,{'lsc':'B003', 'center':'서초 3 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'서초구', 'dong':'양재2동', 'tel' : '02-572-7120'}
			,{'lsc':'B004', 'center':'과천 1 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'서초구', 'dong':'양재1동(우면동)', 'tel' : '02-502-2047'}
			,{'lsc':'B003', 'center':'서초 3 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'서초구', 'dong':'양재1동(우면동제외)', 'tel' : '02-572-7120'}
			,{'lsc':'B001', 'center':'서초 1 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'서초구', 'dong':'잠원동', 'tel' : '02-512-2861'}
			,{'lsc':'B038', 'center':'송파 8 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'가락2동', 'tel' : '02-402-0819'}
			,{'lsc':'B033', 'center':'송파 3 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'가락1동', 'tel' : '02-415-9311'}
			,{'lsc':'B038', 'center':'송파 8 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'가락본동 (1~58)', 'tel' : '02-402-0819'}
			,{'lsc':'B036', 'center':'송파 6 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'가락본동 (59~377)', 'tel' : '02-402-1101'}
			,{'lsc':'B037', 'center':'송파 7 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'거여2동', 'tel' : '02-449-8871'}
			,{'lsc':'B038', 'center':'송파 8 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'거여1동', 'tel' : '02-402-0819'}
			,{'lsc':'B037', 'center':'송파 7 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'마천동', 'tel' : '02-449-8871'}
			,{'lsc':'B033', 'center':'송파 3 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'문정2동', 'tel' : '02-415-9311'}
			,{'lsc':'B038', 'center':'송파 8 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'문정1동', 'tel' : '02-402-0819'}
			,{'lsc':'B036', 'center':'송파 6 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'방이동', 'tel' : '02-402-1101'}
			,{'lsc':'B033', 'center':'송파 3 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'삼전동 (62~73, 101~182)', 'tel' : '02-415-9311'}
			,{'lsc':'B032', 'center':'송파 2 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'삼전동 (1~61, 91~100)', 'tel' : '02-424-9062'}
			,{'lsc':'B033', 'center':'송파 3 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'석촌동', 'tel' : '02-415-9311'}
			,{'lsc':'B036', 'center':'송파 6 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'송파동', 'tel' : '02-402-1101'}
			,{'lsc':'B037', 'center':'송파 7 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'오금동', 'tel' : '02-449-8871'}
			,{'lsc':'B034', 'center':'송파 4 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'오륜동', 'tel' : '02-484-9035'}
			,{'lsc':'B032', 'center':'송파 2 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'잠실3동 (35, 35-1, 35-6)', 'tel' : '02-424-9062'}
			,{'lsc':'B034', 'center':'송파 4 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'잠실4,6동', 'tel' : '02-484-9035'}
			,{'lsc':'B032', 'center':'송파 2 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'잠실2,7동', 'tel' : '02-424-9062'}
			,{'lsc':'B033', 'center':'송파 3 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'잠실3동 (35, 35-1, 35-6 제외)', 'tel' : '02-415-9311'}
			,{'lsc':'B032', 'center':'송파 2 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'잠실본동', 'tel' : '02-424-9062'}
			,{'lsc':'B038', 'center':'송파 8 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'장지동', 'tel' : '02-402-0819'}
			,{'lsc':'B034', 'center':'송파 4 서비스센터', 'bpname':'코원에너지서비스','city':'서울특별시', 'sigungu':'송파구', 'dong':'풍납동', 'tel' : '02-484-9035'}
			,{'lsc':'C001', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'수영구', 'dong':'망미동', 'tel':'1544-0009'}
			,{'lsc':'C001', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'수영구', 'dong':'민락동', 'tel':'1544-0009'}
			,{'lsc':'C001', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'수영구', 'dong':'수영동', 'tel':'1544-0009'}
			,{'lsc':'C001', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'수영구', 'dong':'남천동', 'tel':'1544-0009'}
			,{'lsc':'C001', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'수영구', 'dong':'광안동', 'tel':'1544-0009'}
			,{'lsc':'C001', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'남구', 'dong':'대연3,5동', 'tel':'1544-0009'}
			,{'lsc':'C002', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'동래구', 'dong':'낙민동', 'tel':'1544-0009'}
			,{'lsc':'C002', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'동래구', 'dong':'수안동', 'tel':'1544-0009'}
			,{'lsc':'C002', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'동래구', 'dong':'명륜1동', 'tel':'1544-0009'}
			,{'lsc':'C002', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'동래구', 'dong':'안락동', 'tel':'1544-0009'}
			,{'lsc':'C002', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'동래구', 'dong':'명장동', 'tel':'1544-0009'}
			,{'lsc':'C002', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'동래구', 'dong':'복천동', 'tel':'1544-0009'}
			,{'lsc':'C002', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'동래구', 'dong':'칠산동', 'tel':'1544-0009'}
			,{'lsc':'C002', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'금정구', 'dong':'서동', 'tel':'1544-0009'}
			,{'lsc':'C002', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'금정구', 'dong':'금사동', 'tel':'1544-0009'}
			,{'lsc':'C002', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'금정구', 'dong':'회동동', 'tel':'1544-0009'}
			,{'lsc':'C002', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'연제구', 'dong':'연산동', 'tel':'1544-0009'}
			,{'lsc':'C002', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'연제구', 'dong':'거제1,2동', 'tel':'1544-0009'}
			,{'lsc':'C003', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'부산진구', 'dong':'전포동', 'tel':'1544-0009'}
			,{'lsc':'C003', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'동구', 'dong':'전역', 'tel':'1544-0009'}
			,{'lsc':'C003', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'남구', 'dong':'대연6동', 'tel':'1544-0009'}
			,{'lsc':'C003', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'남구', 'dong':'문현동', 'tel':'1544-0009'}
			,{'lsc':'C004', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'부산진구', 'dong':'가야동', 'tel':'1544-0009'}
			,{'lsc':'C004', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'부산진구', 'dong':'개금동', 'tel':'1544-0009'}
			,{'lsc':'C004', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'부산진구', 'dong':'당감2동', 'tel':'1544-0009'}
			,{'lsc':'C004', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'부산진구', 'dong':'범천동', 'tel':'1544-0009'}
			,{'lsc':'C004', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'부산진구', 'dong':'부전동', 'tel':'1544-0009'}
			,{'lsc':'C004', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'부산진구', 'dong':'초읍동', 'tel':'1544-0009'}
			,{'lsc':'C004', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'부산진구', 'dong':'양정동', 'tel':'1544-0009'}
			,{'lsc':'C004', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'부산진구', 'dong':'연지동', 'tel':'1544-0009'}
			,{'lsc':'C004', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'연제구', 'dong':'거제3,4동', 'tel':'1544-0009'}
			,{'lsc':'C005', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'해운대구', 'dong':'석대동', 'tel':'1544-0009'}
			,{'lsc':'C005', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'해운대구', 'dong':'반여동', 'tel':'1544-0009'}
			,{'lsc':'C005', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'해운대구', 'dong':'재송동', 'tel':'1544-0009'}
			,{'lsc':'C006', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'금정구', 'dong':'부곡3동', 'tel':'1544-0009'}
			,{'lsc':'C006', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'금정구', 'dong':'선동', 'tel':'1544-0009'}
			,{'lsc':'C006', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'금정구', 'dong':'청룡동', 'tel':'1544-0009'}
			,{'lsc':'C006', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'금정구', 'dong':'남산동', 'tel':'1544-0009'}
			,{'lsc':'C006', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'금정구', 'dong':'구서동', 'tel':'1544-0009'}
			,{'lsc':'C006', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'금정구', 'dong':'두구동', 'tel':'1544-0009'}
			,{'lsc':'C006', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'금정구', 'dong':'노포동', 'tel':'1544-0009'}
			,{'lsc':'C006', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'기장군', 'dong':'철마면', 'tel':'1544-0009'}
			,{'lsc':'C008', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사하구', 'dong':'하단동', 'tel':'1544-0009'}
			,{'lsc':'C008', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사상구', 'dong':'엄궁동', 'tel':'1544-0009'}
			,{'lsc':'C008', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사상구', 'dong':'학장동', 'tel':'1544-0009'}
			,{'lsc':'C008', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'강서구', 'dong':'전역', 'tel':'1544-0009'}
			,{'lsc':'C009', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'강서구', 'dong':'대저동', 'tel':'1544-0009'}
			,{'lsc':'C009', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'강서구', 'dong':'강동동', 'tel':'1544-0009'}
			,{'lsc':'C009', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사상구', 'dong':'삼락동', 'tel':'1544-0009'}
			,{'lsc':'C009', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사상구', 'dong':'모라동', 'tel':'1544-0009'}
			,{'lsc':'C009', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'북구', 'dong':'구포동', 'tel':'1544-0009'}
			,{'lsc':'C009', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'북구', 'dong':'덕천1,3동', 'tel':'1544-0009'}
			,{'lsc':'C009', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'북구', 'dong':'만덕동', 'tel':'1544-0009'}
			,{'lsc':'C010', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'영도구', 'dong':'전역', 'tel':'1544-0009'}
			,{'lsc':'C010', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'중구', 'dong':'전역', 'tel':'1544-0009'}
			,{'lsc':'C010', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'서구', 'dong':'전역', 'tel':'1544-0009'}
			,{'lsc':'C011', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사상구', 'dong':'감천동', 'tel':'1544-0009'}
			,{'lsc':'C011', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사상구', 'dong':'주례동', 'tel':'1544-0009'}
			,{'lsc':'C011', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사상구', 'dong':'모라동', 'tel':'1544-0009'}
			,{'lsc':'C011', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사상구', 'dong':'덕포동', 'tel':'1544-0009'}
			,{'lsc':'C011', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사상구', 'dong':'괘법동', 'tel':'1544-0009'}
			,{'lsc':'C012', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사하구', 'dong':'다대동', 'tel':'1544-0009'}
			,{'lsc':'C012', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사하구', 'dong':'장림동', 'tel':'1544-0009'}
			,{'lsc':'C012', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사하구', 'dong':'신평동', 'tel':'1544-0009'}
			,{'lsc':'C012', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사하구', 'dong':'구평동', 'tel':'1544-0009'}
			,{'lsc':'C012', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사하구', 'dong':'당리동', 'tel':'1544-0009'}
			,{'lsc':'C012', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사하구', 'dong':'감천동', 'tel':'1544-0009'}
			,{'lsc':'C012', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사하구', 'dong':'괴정동', 'tel':'1544-0009'}
			,{'lsc':'C012', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'사하구', 'dong':'신평동', 'tel':'1544-0009'}
			,{'lsc':'C012', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'서구', 'dong':'동대신동', 'tel':'1544-0009'}
			,{'lsc':'C012', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'서구', 'dong':'서대신동', 'tel':'1544-0009'}
			,{'lsc':'C012', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'서구', 'dong':'암남동', 'tel':'1544-0009'}
			,{'lsc':'C013', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'북구', 'dong':'금곡동', 'tel':'1544-0009'}
			,{'lsc':'C013', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'북구', 'dong':'화명동', 'tel':'1544-0009'}
			,{'lsc':'C013', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'북구', 'dong':'덕천2동', 'tel':'1544-0009'}
			,{'lsc':'C017', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'해운대구', 'dong':'좌동', 'tel':'1544-0009'}
			,{'lsc':'C017', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'해운대구', 'dong':'중동', 'tel':'1544-0009'}
			,{'lsc':'C017', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'해운대구', 'dong':'송정동', 'tel':'1544-0009'}
			,{'lsc':'C017', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'기장군', 'dong':'기장읍', 'tel':'1544-0009'}
			,{'lsc':'C017', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'기장군', 'dong':'기장읍', 'tel':'1544-0009'}
			,{'lsc':'C019', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'동래구', 'dong':'온천동', 'tel':'1544-0009'}
			,{'lsc':'C019', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'동래구', 'dong':'사직동', 'tel':'1544-0009'}
			,{'lsc':'C019', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'동래구', 'dong':'명륜2동', 'tel':'1544-0009'}
			,{'lsc':'C019', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'금정구', 'dong':'부곡1,2,4동', 'tel':'1544-0009'}
			,{'lsc':'C022', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'기장군', 'dong':'전역', 'tel':'1544-0009'}
			,{'lsc':'C022', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'해운대구', 'dong':'반송동', 'tel':'1544-0009'}
			,{'lsc':'C023', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'남구', 'dong':'대연1,2,4동', 'tel':'1544-0009'}
			,{'lsc':'C023', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'남구', 'dong':'용당동', 'tel':'1544-0009'}
			,{'lsc':'C023', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'남구', 'dong':'감만동', 'tel':'1544-0009'}
			,{'lsc':'C023', 'center':'콜센터', 'bpname':'부산도시가스', 'city':'부산광역시', 'sigungu':'남구', 'dong':'우암동', 'tel':'1544-0009'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'북문로2가', 'tel':'043-211-3883'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'북문로3가', 'tel':'043-211-3883'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'수동', 'tel':'043-211-3883'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'영동', 'tel':'043-211-3883'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 서원구', 'dong':'사직동', 'tel':'043-211-3883'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 청원구', 'dong':'내덕동', 'tel':'043-211-3883'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 청원구', 'dong':'내수읍', 'tel':'043-211-3883'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 청원구', 'dong':'북이면', 'tel':'043-211-3883'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 청원구', 'dong':'사천동', 'tel':'043-211-3883'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 청원구', 'dong':'오동동', 'tel':'043-211-3883'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 청원구', 'dong':'우암동', 'tel':'043-211-3883'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 청원구', 'dong':'율량동', 'tel':'043-211-3883'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 청원구', 'dong':'주성동', 'tel':'043-211-3883'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 청원구', 'dong':'주중동', 'tel':'043-211-3883'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'봉명동', 'tel':'043-211-3883'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'신봉동', 'tel':'043-211-3883'}
			,{'lsc':'D001', 'center':'충청 제1서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'운천동', 'tel':'043-211-3883'}
			,{'lsc':'D002', 'center':'충청 제2서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'세종시', 'dong':'부강면', 'tel':'043-291-2003'}
			,{'lsc':'D002', 'center':'충청 제2서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'세종시', 'dong':'부용면', 'tel':'043-291-2003'}
			,{'lsc':'D002', 'center':'충청 제2서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'영운동', 'tel':'043-291-2003'}
			,{'lsc':'D002', 'center':'충청 제2서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 서원구', 'dong':'개신동', 'tel':'043-291-2003'}
			,{'lsc':'D002', 'center':'충청 제2서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 서원구', 'dong':'모충동', 'tel':'043-291-2003'}
			,{'lsc':'D002', 'center':'충청 제2서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 서원구', 'dong':'사직동', 'tel':'043-291-2003'}
			,{'lsc':'D002', 'center':'충청 제2서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 서원구', 'dong':'사창동', 'tel':'043-291-2003'}
			,{'lsc':'D002', 'center':'충청 제2서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 서원구', 'dong':'산남동', 'tel':'043-291-2003'}
			,{'lsc':'D002', 'center':'충청 제2서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 서원구', 'dong':'성화동', 'tel':'043-291-2003'}
			,{'lsc':'D002', 'center':'충청 제2서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 서원구', 'dong':'수곡동', 'tel':'043-291-2003'}
			,{'lsc':'D002', 'center':'충청 제2서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 서원구', 'dong':'현도면', 'tel':'043-291-2003'}
			,{'lsc':'D002', 'center':'충청 제2서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'모충동', 'tel':'043-291-2003'}
			,{'lsc':'D002', 'center':'충청 제2서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'사창동', 'tel':'043-291-2003'}
			,{'lsc':'D002', 'center':'충청 제2서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'수곡동', 'tel':'043-291-2003'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'금천동', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'남문로1가', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'남문로2가', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'남주동', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'대성동', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'문화동', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'방서동', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'북문로1가', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'서문동', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'서운동', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'석교동', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'용담동', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'용암동', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'용정동', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'운동동', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 상당구', 'dong':'탑동', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 서원구', 'dong':'미평동', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 서원구', 'dong':'분평동', 'tel':'043-291-9421'}
			,{'lsc':'D003', 'center':'충청 제3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 서원구', 'dong':'산남동', 'tel':'043-291-9421'}
			,{'lsc':'D004', 'center':'충청 제4서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 청원구', 'dong':'오창읍', 'tel':'043-271-2777'}
			,{'lsc':'D004', 'center':'충청 제4서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'복대동', 'tel':'043-271-2777'}
			,{'lsc':'D004', 'center':'충청 제4서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'봉명동', 'tel':'043-271-2777'}
			,{'lsc':'D004', 'center':'충청 제4서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'송절동', 'tel':'043-271-2777'}
			,{'lsc':'D004', 'center':'충청 제4서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'송정동', 'tel':'043-271-2777'}
			,{'lsc':'D004', 'center':'충청 제4서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'향정동', 'tel':'043-271-2777'}
			,{'lsc':'D005', 'center':'충청 제5서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 서원구', 'dong':'죽림동', 'tel':'043-235-7001'}
			,{'lsc':'D005', 'center':'충청 제5서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'가경동', 'tel':'043-235-7001'}
			,{'lsc':'D005', 'center':'충청 제5서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'강내면', 'tel':'043-235-7001'}
			,{'lsc':'D005', 'center':'충청 제5서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'강서동', 'tel':'043-235-7001'}
			,{'lsc':'D005', 'center':'충청 제5서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'복대동', 'tel':'043-235-7001'}
			,{'lsc':'D005', 'center':'충청 제5서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'비하동', 'tel':'043-235-7001'}
			,{'lsc':'D005', 'center':'충청 제5서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'오송읍', 'tel':'043-235-7001'}
			,{'lsc':'D005', 'center':'충청 제5서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'옥산면', 'tel':'043-235-7001'}
			,{'lsc':'D005', 'center':'충청 제5서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'청주시 흥덕구', 'dong':'지동동', 'tel':'043-235-7001'}
			,{'lsc':'D041', 'center':'서부지역서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'괴산군', 'dong':'괴산읍', 'tel':'043-883-0335'}
			,{'lsc':'D041', 'center':'서부지역서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'증평군', 'dong':'증평읍', 'tel':'043-883-0335'}
			,{'lsc':'D051', 'center':'서부지역서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'음성군', 'dong':'감곡면', 'tel':'043-883-0335'}
			,{'lsc':'D051', 'center':'서부지역서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'음성군', 'dong':'금왕읍', 'tel':'043-883-0335'}
			,{'lsc':'D051', 'center':'서부지역서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'음성군', 'dong':'대소면', 'tel':'043-883-0335'}
			,{'lsc':'D051', 'center':'서부지역서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'음성군', 'dong':'맹동면', 'tel':'043-883-0335'}
			,{'lsc':'D051', 'center':'서부지역서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'음성군', 'dong':'삼성면', 'tel':'043-883-0335'}
			,{'lsc':'D051', 'center':'서부지역서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'음성군', 'dong':'생극면', 'tel':'043-883-0335'}
			,{'lsc':'D051', 'center':'서부지역서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'음성군', 'dong':'원남면', 'tel':'043-883-0335'}
			,{'lsc':'D051', 'center':'서부지역서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'음성군', 'dong':'음성읍', 'tel':'043-883-0335'}
			,{'lsc':'D061', 'center':'서부지역서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'진천군', 'dong':'광혜원면', 'tel':'043-883-0335'}
			,{'lsc':'D061', 'center':'서부지역서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'진천군', 'dong':'덕산면', 'tel':'043-883-0335'}
			,{'lsc':'D061', 'center':'서부지역서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'진천군', 'dong':'문백면', 'tel':'043-883-0335'}
			,{'lsc':'D061', 'center':'서부지역서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'진천군', 'dong':'이월면', 'tel':'043-883-0335'}
			,{'lsc':'D061', 'center':'서부지역서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'진천군', 'dong':'진천읍', 'tel':'043-883-0335'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'단양군', 'dong':'단양읍', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'강제동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'고암동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'교동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'남천동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'동현동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'명동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'명지동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'모산동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'봉양읍', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'서부동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'신백동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'영천동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'왕암동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'의림동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'장락동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'중앙로2가', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'천남동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'청전동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'하소동', 'tel':'043-645-8182'}
			,{'lsc':'D071', 'center':'제천서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'제천시', 'dong':'화산동', 'tel':'043-645-8182'}
			,{'lsc':'D081', 'center':'3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'영동군', 'dong':'양강면', 'tel':'043-291-9421'}
			,{'lsc':'D081', 'center':'3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'영동군', 'dong':'영동읍', 'tel':'043-291-9421'}
			,{'lsc':'D081', 'center':'3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'영동군', 'dong':'용산면', 'tel':'043-291-9421'}
			,{'lsc':'D081', 'center':'3서비스센터', 'bpname':'충청에너지서비스', 'city':'충청북도', 'sigungu':'옥천군', 'dong':'옥천읍', 'tel':'043-291-9421'}
			,{'lsc':'E001', 'center':'제1지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'진평동', 'tel':'054-471-2155'}
			,{'lsc':'E001', 'center':'제1지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'시미동', 'tel':'054-471-2155'}
			,{'lsc':'E001', 'center':'제1지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'임수동', 'tel':'054-471-2155'}
			,{'lsc':'E001', 'center':'제1지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'구평동', 'tel':'054-471-2155'}
			,{'lsc':'E001', 'center':'제1지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'공단동', 'tel':'054-471-2155'}
			,{'lsc':'E001', 'center':'제1지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'광평동', 'tel':'054-471-2155'}
			,{'lsc':'E001', 'center':'제1지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'칠곡군', 'dong':'석적읍', 'tel':'054-471-2155'}
			,{'lsc':'E071', 'center':'영남에너지서비스', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'청도군', 'dong':'전역', 'tel':'054-471-2155'}
			,{'lsc':'E002', 'center':'제2지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'사곡동', 'tel':'054-464-1780'}
			,{'lsc':'E002', 'center':'제2지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'상모동', 'tel':'054-464-1780'}
			,{'lsc':'E002', 'center':'제2지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'오태동', 'tel':'054-464-1780'}
			,{'lsc':'E002', 'center':'제2지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'형곡동', 'tel':'054-464-1780'}
			,{'lsc':'E002', 'center':'제2지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'임은동', 'tel':'054-464-1780'}
			,{'lsc':'E002', 'center':'제2지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'칠곡군', 'dong':'북삼읍', 'tel':'054-464-1780'}
			,{'lsc':'E002', 'center':'제2지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'칠곡군', 'dong':'왜관읍', 'tel':'054-464-1780'}
			,{'lsc':'E002', 'center':'제2지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'칠곡군', 'dong':'약목면', 'tel':'054-464-1780'}
			,{'lsc':'E002', 'center':'제2지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'칠곡군', 'dong':'기산면', 'tel':'054-464-1780'}
			,{'lsc':'E003', 'center':'제3지역 서비스 센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'도량동', 'tel':'054-444-2268'}
			,{'lsc':'E003', 'center':'제3지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'봉곡동', 'tel':'054-444-2268'}
			,{'lsc':'E003', 'center':'제3지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'선기동', 'tel':'054-444-2268'}
			,{'lsc':'E003', 'center':'제3지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'고아읍', 'tel':'054-444-2268'}
			,{'lsc':'E003', 'center':'제3지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'남통동', 'tel':'054-444-2268'}
			,{'lsc':'E003', 'center':'제3지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'선산읍', 'tel':'054-444-2268'}
			,{'lsc':'E003', 'center':'제3지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'송정동', 'tel':'054-444-2268'}
			,{'lsc':'E003', 'center':'제3지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'원평동', 'tel':'054-444-2268'}
			,{'lsc':'E051', 'center':'제3지역 서비스 센타', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'김천시', 'dong':'전역', 'tel':'054-444-2268'}
			,{'lsc':'E005', 'center':'제5지역 서비스 센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'거의동', 'tel':'054-473-0093'}
			,{'lsc':'E005', 'center':'제5지역 서비스 센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'구포동', 'tel':'054-473-0093'}
			,{'lsc':'E005', 'center':'제5지역 서비스 센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'금정동', 'tel':'054-473-0093'}
			,{'lsc':'E005', 'center':'제5지역 서비스 센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'비산동', 'tel':'054-473-0093'}
			,{'lsc':'E005', 'center':'제5지역 서비스 센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'산동면', 'tel':'054-473-0093'}
			,{'lsc':'E005', 'center':'제5지역 서비스 센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'양호동', 'tel':'054-473-0093'}
			,{'lsc':'E005', 'center':'제5지역 서비스 센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'옥계동', 'tel':'054-473-0093'}
			,{'lsc':'E005', 'center':'제5지역 서비스 센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'인의동', 'tel':'054-473-0093'}
			,{'lsc':'E005', 'center':'제5지역 서비스 센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'황상동', 'tel':'054-473-0093'}
			,{'lsc':'E005', 'center':'제5지역 서비스 센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'지산동', 'tel':'054-473-0093'}
			,{'lsc':'E005', 'center':'제5지역 서비스 센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'구미시', 'dong':'신평동', 'tel':'054-473-0093'}
			,{'lsc':'E061', 'center':'영남에너지서비스', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'상주시', 'dong':'전역', 'tel':'054-444-2268'}
			,{'lsc':'E061', 'center':'영남에너지서비스', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'문경시', 'dong':'전역', 'tel':'054-444-2268'}
			,{'lsc':'F001', 'center':'제1서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'용흥동', 'tel':'054-242-8016'}
			,{'lsc':'F001', 'center':'제1서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'우현동', 'tel':'054-242-8016'}
			,{'lsc':'F001', 'center':'제1서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'신흥동', 'tel':'054-242-8016'}
			,{'lsc':'F001', 'center':'제1서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'남구', 'dong':'송도동', 'tel':'054-242-8016'}
			,{'lsc':'F001', 'center':'제1서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'남구', 'dong':'해도동', 'tel':'054-242-8016'}
			,{'lsc':'F001', 'center':'제1서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'흥해읍', 'tel':'054-242-8016'}
			,{'lsc':'F001', 'center':'제1서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'학산동', 'tel':'054-242-8016'}
			,{'lsc':'F001', 'center':'제1서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'대신동', 'tel':'054-242-8016'}
			,{'lsc':'F001', 'center':'제1서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'대흥동', 'tel':'054-242-8016'}
			,{'lsc':'F001', 'center':'제1서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'남공', 'dong':'대이동', 'tel':'054-242-8016'}
			,{'lsc':'F001', 'center':'제1서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'덕수동', 'tel':'054-242-8016'}
			,{'lsc':'F002', 'center':'제2서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'남구', 'dong':'오천읍', 'tel':'054-285-0853'}
			,{'lsc':'F002', 'center':'제2서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'남구', 'dong':'연일읍', 'tel':'054-285-0853'}
			,{'lsc':'F002', 'center':'제2서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'남구', 'dong':'대송면', 'tel':'054-285-0853'}
			,{'lsc':'F002', 'center':'제2서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'남구', 'dong':'동해면', 'tel':'054-285-0853'}
			,{'lsc':'F002', 'center':'제2서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'남구', 'dong':'효자동', 'tel':'054-285-0853'}
			,{'lsc':'F002', 'center':'제2서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'남구', 'dong':'인덕동', 'tel':'054-285-0853'}
			,{'lsc':'F002', 'center':'제2서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'남구', 'dong':'청림동', 'tel':'054-285-0853'}
			,{'lsc':'F003', 'center':'제3서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'남빈동', 'tel':'054-614-6161'}
			,{'lsc':'F003', 'center':'제3서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'덕산동', 'tel':'054-614-6161'}
			,{'lsc':'F003', 'center':'제3서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'두호동', 'tel':'054-614-6161'}
			,{'lsc':'F003', 'center':'제3서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'동빈동', 'tel':'054-614-6161'}
			,{'lsc':'F003', 'center':'제3서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'상원동', 'tel':'054-614-6161'}
			,{'lsc':'F003', 'center':'제3서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'양덕동', 'tel':'054-614-6161'}
			,{'lsc':'F003', 'center':'제3서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'여천동', 'tel':'054-614-6161'}
			,{'lsc':'F003', 'center':'제3서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'장성동', 'tel':'054-614-6161'}
			,{'lsc':'F003', 'center':'제3서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'중앙동', 'tel':'054-614-6161'}
			,{'lsc':'F003', 'center':'제3서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'창포동', 'tel':'054-614-6161'}
			,{'lsc':'F003', 'center':'제3서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'항구동', 'tel':'054-614-6161'}
			,{'lsc':'F003', 'center':'제3서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'환호동', 'tel':'054-614-6161'}
			,{'lsc':'F004', 'center':'제4서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'남구', 'dong':'상도동', 'tel':'054-614-8282'}
			,{'lsc':'F004', 'center':'제4서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'죽도동', 'tel':'054-614-8282'}
			,{'lsc':'F004', 'center':'제4서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'남구', 'dong':'학잠동', 'tel':'054-614-8282'}
			,{'lsc':'F004', 'center':'제4서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'남구', 'dong':'대도동', 'tel':'054-614-8282'}
			,{'lsc':'F004', 'center':'제4서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'남구', 'dong':'대잠동', 'tel':'054-614-8282'}
			,{'lsc':'F004', 'center':'제4서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'북구', 'dong':'득량동', 'tel':'054-614-8282'}
			,{'lsc':'F004', 'center':'제4서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'남구', 'dong':'지곡동', 'tel':'054-614-8282'}
			,{'lsc':'F004', 'center':'제4서비스센터', 'bpname':'영남에너지서비스', 'city':'경상북도', 'sigungu':'남구', 'dong':'효자동', 'tel':'054-614-8282'}
			,{'lsc':'G001', 'center':'도시가스 순천서비스센터', 'bpname':'전남에너지서비스', 'city':'전라남도', 'sigungu':'순천시', 'dong':'전체', 'tel':'061-727-0176'}
			,{'lsc':'G001', 'center':'도시가스 순천서비스센터', 'bpname':'전남에너지서비스', 'city':'전라남도', 'sigungu':'광양시', 'dong':'덕례리', 'tel':'061-727-0176'}
			,{'lsc':'G003', 'center':'도시가스 광양서비스센터', 'bpname':'전남에너지서비스', 'city':'전라남도', 'sigungu':'광양시', 'dong':'덕례리 제외', 'tel':'061-794-0303'}
			,{'lsc':'G004', 'center':'도시가스 곡성지사', 'bpname':'전남에너지서비스', 'city':'전라남도', 'sigungu':'곡성군', 'dong':'전체', 'tel':'061-362-9030'}
			,{'lsc':'G005', 'center':'도시가스 곡성지사(구례)', 'bpname':'전남에너지서비스', 'city':'전라남도', 'sigungu':'곡성군', 'dong':'전체', 'tel':'061-362-9030'}
			,{'lsc':'G051', 'center':'전남 광양1지역관리소', 'bpname':'전남에너지서비스', 'city':'전라남도', 'sigungu':'광양시', 'dong':'중동', 'tel':'061-362-9030'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'1~30 번지, 724~778번지', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'만천리, 장학리', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'후평3동', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'봉의동', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'옥천동', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'소양로1가', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'소양로2가', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'거두리', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'조양동', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'후평2동', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'우두동', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'사농동', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'신동면', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'효자3동', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'운교동', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'효자1동', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'죽림동', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'교동', 'tel':'033-257-3591'}
			,{'lsc':'J001', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'후평1동', 'tel':'033-257-3591'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'효자2동', 'tel':'033-242-3390'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'낙원동', 'tel':'033-242-3390'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'소양로3가', 'tel':'033-242-3390'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'소양로4가', 'tel':'033-242-3390'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'요선동', 'tel':'033-242-3390'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'퇴계동', 'tel':'033-242-3390'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'0~723번지 779~ 번지', 'tel':'033-242-3390'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'약사동', 'tel':'033-242-3390'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'근화동', 'tel':'033-242-3390'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'학곡리', 'tel':'033-242-3390'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'칠전동', 'tel':'033-242-3390'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'중앙로 1가', 'tel':'033-242-3390'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'중앙로 2가', 'tel':'033-242-3390'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'중앙로 3가', 'tel':'033-242-3390'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'온의동', 'tel':'033-242-3390'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'춘천시', 'dong':'동산면', 'tel':'033-242-3390'}
			,{'lsc':'J051', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'홍천군', 'dong':'홍천읍', 'tel':'033-242-3390'}
			,{'lsc':'J051', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'홍천군', 'dong':'북방면', 'tel':'033-242-3390'}
			,{'lsc':'J002', 'center':'강원 서비스센터', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'홍천군', 'dong':'서면', 'tel':'033-242-3390'}
			,{'lsc':'J061', 'center':'강원도시가스(주) 영월', 'bpname':'강원도시가스', 'city':'강원도', 'sigungu':'영월군', 'dong':'영월읍', 'tel':'033-258-8868'}
			,{'lsc':'K001', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'갈산동', 'tel':'063-833-0507'}
			,{'lsc':'K001', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'금강동', 'tel':'063-833-0507'}
			,{'lsc':'K001', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'금마면', 'tel':'063-833-0507'}
			,{'lsc':'K001', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'남중동', 'tel':'063-833-0507'}
			,{'lsc':'K001', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'덕기동', 'tel':'063-833-0507'}
			,{'lsc':'K001', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'동산동', 'tel':'063-833-0507'}
			,{'lsc':'K001', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'마동', 'tel':'063-833-0507'}
			,{'lsc':'K001', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'부송동', 'tel':'063-833-0507'}
			,{'lsc':'K001', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'석왕동', 'tel':'063-833-0507'}
			,{'lsc':'K001', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'신흥동', 'tel':'063-833-0507'}
			,{'lsc':'K001', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'어양동', 'tel':'063-833-0507'}
			,{'lsc':'K001', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'여산면', 'tel':'063-833-0507'}
			,{'lsc':'K001', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'인화동', 'tel':'063-833-0507'}
			,{'lsc':'K001', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'주현동', 'tel':'063-833-0507'}
			,{'lsc':'K001', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'중앙동', 'tel':'063-833-0507'}
			,{'lsc':'K001', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'팔봉동', 'tel':'063-833-0507'}
			,{'lsc':'K002', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'낭산면', 'tel':'063-856-7592'}
			,{'lsc':'K002', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'모현동', 'tel':'063-856-7592'}
			,{'lsc':'K002', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'송학동', 'tel':'063-856-7592'}
			,{'lsc':'K002', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'신동', 'tel':'063-856-7592'}
			,{'lsc':'K002', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'신용동', 'tel':'063-856-7592'}
			,{'lsc':'K002', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'영등동', 'tel':'063-856-7592'}
			,{'lsc':'K002', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'오산면', 'tel':'063-856-7592'}
			,{'lsc':'K002', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'창인동', 'tel':'063-856-7592'}
			,{'lsc':'K002', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'평화동', 'tel':'063-856-7592'}
			,{'lsc':'K002', 'center':'익산서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'익산시', 'dong':'황등면', 'tel':'063-856-7592'}
			,{'lsc':'K051', 'center':'정읍서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'정읍시', 'dong':'공평동', 'tel':'063-531-6210'}
			,{'lsc':'K051', 'center':'정읍서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'정읍시', 'dong':'구룡동', 'tel':'063-531-6210'}
			,{'lsc':'K051', 'center':'정읍서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'정읍시', 'dong':'농소동', 'tel':'063-531-6210'}
			,{'lsc':'K051', 'center':'정읍서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'정읍시', 'dong':'북면', 'tel':'063-531-6210'}
			,{'lsc':'K051', 'center':'정읍서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'정읍시', 'dong':'상동', 'tel':'063-531-6210'}
			,{'lsc':'K051', 'center':'정읍서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'정읍시', 'dong':'송산동', 'tel':'063-531-6210'}
			,{'lsc':'K051', 'center':'정읍서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'정읍시', 'dong':'수성동', 'tel':'063-531-6210'}
			,{'lsc':'K051', 'center':'정읍서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'정읍시', 'dong':'시기동', 'tel':'063-531-6210'}
			,{'lsc':'K051', 'center':'정읍서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'정읍시', 'dong':'연지동', 'tel':'063-531-6210'}
			,{'lsc':'K051', 'center':'정읍서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'정읍시', 'dong':'장명동', 'tel':'063-531-6210'}
			,{'lsc':'K051', 'center':'정읍서비스센터', 'bpname':'전북에너지서비스', 'city':'전라북도', 'sigungu':'정읍시', 'dong':'하북동', 'tel':'063-531-6210'}];
			setAlopexCookie('lscDB',JSON.stringify(ss));
//			setAlopexCookie('lscDB_Ver','1.0');
//			for(var i=0;i<ss.length;i++){
//				setAlopexCookie(ss[i].lsc,JSON.stringify(ss[i]));
//			}
			runDB_Next();
		}else{
			runDB_Next();
		}
	}
	
	function runDB_Next(){
		var lcsVerCookie = getAlopexCookie('lscDB_Ver');
		if(getAlopexCookie('lscDB2') == 'undefined' || lcsVerCookie != lscVer){
			var ss = [{'LAT':37.5116201,'LNG':127.0161495,'lsc':'B001','bpname':'코원에너지서비스','lscNm':'서초 1 지역서비스센터','tel':'02-512-2861','addr':'서초구 잠원동 48-1 삼형캐슬 202호'}
			,{'LAT':37.4900279,'LNG':127.0126457,'lsc':'B002','bpname':'코원에너지서비스','lscNm':'서초 2 지역서비스센터','tel':'02-597-7347','addr':'서초구 서초대로48길 65 (서초동,101호,B1F)'}
			,{'LAT':37.4811995,'LNG':127.0409969,'lsc':'B003','bpname':'코원에너지서비스','lscNm':'서초 3 지역서비스센터','tel':'02-572-7120','addr':'서울시 서초구 양재동 19-11, 우빈빌딩, 2층'}
			,{'LAT':37.4318732,'LNG':127.000025,'lsc':'B004','bpname':'코원에너지서비스','lscNm':'서울 과천1서비스센터','tel':'02-502-2047','addr':'경기도 과천시 부림동 49, 주동 7단지상가, 2층'}
			,{'LAT':37.520736,'LNG':127.0207008,'lsc':'B011','bpname':'코원에너지서비스','lscNm':'강남 1 지역서비스센터','tel':'02-3442-0341','addr':'서울시 강남구 신사동 523-14, 2층'}
			,{'LAT':37.505846,'LNG':127.0401151,'lsc':'B012','bpname':'코원에너지서비스','lscNm':'강남 4 지역서비스센터','tel':'02-547-0083','addr':'서울시 강남구 역삼동 663-32(2층)'}
			,{'LAT':37.5077441,'LNG':127.0255294,'lsc':'B013','bpname':'코원에너지서비스','lscNm':'강남 3 지역서비스센터','tel':'02-516-3451','addr':'강남구 강남대로122길 30-10 (논현동,201호)'}
			,{'LAT':37.505846,'LNG':127.0401151,'lsc':'B014','bpname':'코원에너지서비스','lscNm':'강남 4 지역서비스센터','tel':'02-547-0083','addr':'서울시 강남구 역삼동 663-32(2층)'}
			,{'LAT':37.5002775,'LNG':127.0531709,'lsc':'B016','bpname':'코원에너지서비스','lscNm':'강남 6 지역서비스센터','tel':'02-538-1824','addr':'서울시 강남구 대치동 919-3, 2층'}
			,{'LAT':37.4811995,'LNG':127.0409969,'lsc':'B017','bpname':'코원에너지서비스','lscNm':'서초 3 지역서비스센터','tel':'02-574-5706','addr':'서울시 서초구 양재동 19-11, 우빈빌딩, 2층'}
			,{'LAT':37.4832307,'LNG':127.0623446,'lsc':'B018','bpname':'코원에너지서비스','lscNm':'강남 8 지역서비스센터','tel':'02-579-6522','addr':'강남구 선릉로6길 19 (개포동,1층101호)'}
			,{'LAT':37.4898669,'LNG':127.0814999,'lsc':'B020','bpname':'코원에너지서비스','lscNm':'강남 10 지역서비스센터','tel':'02-2226-5821','addr':'서울시 강남구 일원동 684-5 번지 3층'}
			,{'LAT':37.5086462,'LNG':127.0798153,'lsc':'B032','bpname':'코원에너지서비스','lscNm':'송파 2 지역서비스센터','tel':'02-424-9062','addr':'서울시 송파구 잠실동 197-1, 2층'}
			,{'LAT':37.5047988,'LNG':127.1014889,'lsc':'B033','bpname':'코원에너지서비스','lscNm':'송파 3 지역서비스센터','tel':'02-415-9304','addr':'서울시 송파구 석촌동 57-3, 2층'}
			,{'LAT':37.5292565,'LNG':127.1179234,'lsc':'B034','bpname':'코원에너지서비스','lscNm':'송파 4 지역서비스센터','tel':'02-484-9035','addr':'서울시 송파구 풍납동 407-8, 1층'}
			,{'LAT':37.496639,'LNG':127.1196925,'lsc':'B036','bpname':'코원에너지서비스','lscNm':'송파 6 지역서비스센터','tel':'02-402-1101','addr':'서울시 송파구 가락동 86-2, 1층'}
			,{'LAT':37.4987505,'LNG':127.1409124,'lsc':'B037','bpname':'코원에너지서비스','lscNm':'송파 7 지역서비스센터','tel':'02-449-8871','addr':'서울시 송파구 오금동 146, 2층'}
			,{'LAT':37.4879946,'LNG':127.1267878,'lsc':'B038','bpname':'코원에너지서비스','lscNm':'송파 8 지역서비스센터','tel':'02-402-0819','addr':'서울시 송파구 문정동 33-10, 2층'}
			,{'LAT':37.5542965,'LNG':127.1300439,'lsc':'B041','bpname':'코원에너지서비스','lscNm':'강동 1 지역서비스센터','tel':'02-441-0009','addr':'서울시 강동구 암사동462-24, 2층'}
			,{'LAT':37.549309,'LNG':127.1725148,'lsc':'B044','bpname':'코원에너지서비스','lscNm':'강동 4 지역서비스센터','tel':'02-426-1405','addr':'서울시 강동구 상일동 269-5, 2층'}
			,{'LAT':37.5367102,'LNG':127.1332652,'lsc':'B045','bpname':'코원에너지서비스','lscNm':'강동 5 지역서비스센터','tel':'02-477-7792','addr':'서울특별시 강동구 진황도로 18 현대프라자 1F'}
			,{'LAT':37.531492,'LNG':127.130801,'lsc':'B046','bpname':'코원에너지서비스','lscNm':'강동 6 지역서비스센터','tel':'02-470-4283','addr':'서울시 강동구 성내동 514-1 1층'}
			,{'LAT':37.5400089,'LNG':127.1429084,'lsc':'B047','bpname':'코원에너지서비스','lscNm':'강동 7 지역서비스센터','tel':'02-476-0675','addr':'서울시 강동구 길동 356-1, 1층'}
			,{'LAT':37.4430734,'LNG':127.1275599,'lsc':'B051','bpname':'코원에너지서비스','lscNm':'성남 1 지역서비스센터','tel':'031-755-0811','addr':'성남시 수정구 성남대로 1270 (태평동,2층)'}
			,{'LAT':37.4448316,'LNG':127.1378971,'lsc':'B052','bpname':'코원에너지서비스','lscNm':'성남 2 지역서비스센터','tel':'031-757-7005','addr':'경기도 성남시 수정구 태평동 3330, 2층'}
			,{'LAT':37.4400988,'LNG':127.1299743,'lsc':'B053','bpname':'코원에너지서비스','lscNm':'성남 3 지역서비스센터','tel':'031-754-4541','addr':'경기도 성남시 수정구 수진동 2963, 2층'}
			,{'LAT':37.4507304,'LNG':127.1511513,'lsc':'B054','bpname':'코원에너지서비스','lscNm':'성남 4 지역서비스센터','tel':'031-734-6536','addr':'경기도 성남시 수정구 신흥동 136-4, 2층'}
			,{'LAT':37.4472048,'LNG':127.158631,'lsc':'B056','bpname':'코원에너지서비스','lscNm':'성남 6 지역서비스센터','tel':'031-732-4655','addr':'경기도 성남시 중원구 금광동 4495 1층'}
			,{'LAT':37.4409973,'LNG':127.1647272,'lsc':'B057','bpname':'코원에너지서비스','lscNm':'성남 7 지역서비스센터','tel':'031-731-1261','addr':'경기도 성남시 중원구 상대원동 787, 1층'}
			,{'LAT':37.4403526,'LNG':127.1493745,'lsc':'B058','bpname':'코원에너지서비스','lscNm':'성남 8 지역서비스센터','tel':'031-731-0865','addr':'성남시 중원구 광명로 199 (중앙동,금강빌라201호)'}
			,{'LAT':37.4078059,'LNG':127.1430174,'lsc':'B061','bpname':'코원에너지서비스','lscNm':'분당 1 지역서비스센터','tel':'031-705-1108','addr':'경기도 성남시 분당구 야탑동 주공3단지 관리사무소 2층'}
			,{'LAT':37.3842664,'LNG':127.132142,'lsc':'B062','bpname':'코원에너지서비스','lscNm':'분당 2 지역서비스센터','tel':'031-706-1787','addr':'성남시 분당구 안골로 1 (서현동,2층)'}
			,{'LAT':37.3786736,'LNG':127.1017436,'lsc':'B063','bpname':'코원에너지서비스','lscNm':'분당 3 지역서비스센터','tel':'031-711-4452','addr':'경기도 성남시 분당구 백현동 406-4, 1층'}
			,{'LAT':37.3455712,'LNG':127.1111028,'lsc':'B064','bpname':'코원에너지서비스','lscNm':'분당 4 지역서비스센터','tel':'031-713-2271','addr':'경기도 성남시 분당구 구미동 144-1 구미제2조합상가 204호'}
			,{'LAT':37.3774608,'LNG':127.10223,'lsc':'B065','bpname':'코원에너지서비스','lscNm':'판교 지역서비스센터','tel':'031-781-7322','addr':'성남시 분당구 대왕판교로 378 (백현동,2층)'}
			,{'LAT':37.4318732,'LNG':127.000025,'lsc':'B066','bpname':'코원에너지서비스','lscNm':'과천 1 지역서비스센터','tel':'02-502-2047','addr':'경기도 과천시 부림동 49 주동7단지상가, 2층'}
			,{'LAT':37.5468948,'LNG':127.198605,'lsc':'B070','bpname':'코원에너지서비스','lscNm':'하남 1 지역서비스센터','tel':'031-794-8475','addr':'경기도 하남시 덕풍동 343-6, 2층'}
			,{'LAT':37.2782046,'LNG':127.4382013,'lsc':'B080','bpname':'코원에너지서비스','lscNm':'이천 1 지역서비스센터','tel':'031-637-8146','addr':'경기도 이천시 중리동 4-12. 1층'}
			,{'LAT':37.295059,'LNG':127.639873,'lsc':'B081','bpname':'코원에너지서비스','lscNm':'여주 1 지역서비스센터','tel':'031-885-0451','addr':'경기도 여주군 여주읍 교동 19, 1층'}
			,{'LAT':37.3949974,'LNG':127.2442372,'lsc':'B090','bpname':'코원에너지서비스','lscNm':'광주 1지역서비스센터','tel':'031-765-0643','addr':'경기도 광주시 장지동 77-11, 2층'}
			,{'LAT':37.4987505,'LNG':127.1409124,'lsc':'B091','bpname':'코원에너지서비스','lscNm':'송파 7 지역서비스센터','tel':'02-449-8871','addr':'송파구 문정로 229 (오금동,2층)'}
			,{'LAT':37.4045386,'LNG':127.2688375,'lsc':'B092','bpname':'코원에너지서비스','lscNm':'광주 2지역서비스센터','tel':'031-765-0967','addr':'경기도 광주시 쌍령동 107-4, 2층'}
			,{'LAT':35.1631139,'LNG':129.1635509,'lsc':'C001','bpname':'부산도시가스','lscNm':'광안 서비스센터','tel':'1544-0009','addr':'해운대구 구남로12번길 58(우동, 3층)'}
			,{'LAT':35.1976058,'LNG':129.0953192,'lsc':'C002','bpname':'부산도시가스','lscNm':'동래연제 서비스센터','tel':'1544-0009','addr':'부산광역시 동래구 낙민동 13-6 에스빼랑스 빌딩 6층'}
			,{'LAT':35.1339174,'LNG':129.0767526,'lsc':'C003','bpname':'부산도시가스','lscNm':'문현 서비스센터','tel':'1544-0009','addr':'남구 동제당로 6. 2층'}
			,{'LAT':35.1582469,'LNG':129.048773,'lsc':'C004','bpname':'부산도시가스','lscNm':'가야 서비스센터','tel':'1544-0009','addr':'진구 가야대로 703번길 30, 202호'}
			,{'LAT':35.1631139,'LNG':129.1635509,'lsc':'C005','bpname':'부산도시가스','lscNm':'재송반여 서비스센터','tel':'1544-0009','addr':'해운대구 재반로 116. 9층'}
			,{'LAT':35.2644365,'LNG':129.0926966,'lsc':'C006','bpname':'부산도시가스','lscNm':'금정 서비스센터','tel':'1544-0009','addr':'금정구 중앙대로 2018-1 부광빌딩 3층'}
			,{'LAT':35.1909427,'LNG':128.992648,'lsc':'C007','bpname':'부산도시가스','lscNm':'부산 7 지역 관리소','tel':'1544-0009','addr':'사상구 모라동 1342'}
			,{'LAT':35.1087063,'LNG':128.9671576,'lsc':'C008','bpname':'부산도시가스','lscNm':'을숙도 서비스센터','tel':'1544-0009','addr':'사하구 낙동대로 496(하단동 제일빌딩 5층)'}
			,{'LAT':35.1990424,'LNG':128.9977167,'lsc':'C009','bpname':'부산도시가스','lscNm':'구포 서비스센터','tel':'1544-0009','addr':'북구 백양대로 1050번 가길 12. 1층'}
			,{'LAT':35.1020498,'LNG':129.0352308,'lsc':'C010','bpname':'부산도시가스','lscNm':'중앙 서비스센터','tel':'1544-0009','addr':'중구 대청로 138번길 9 2층'}
			,{'LAT':35.1537178,'LNG':128.9992516,'lsc':'C011','bpname':'부산도시가스','lscNm':'주례 서비스센터','tel':'1544-0009','addr':'사상구 백양대로 494번길 12 (주례동일 APT 상가 106-209)'}
			,{'LAT':35.0826506,'LNG':128.9691561,'lsc':'C012','bpname':'부산도시가스','lscNm':'장림 서비스센터','tel':'1544-0009','addr':'사하구 장림로 183(장림동, 2층)'}
			,{'LAT':35.2341462,'LNG':129.0179257,'lsc':'C013','bpname':'부산도시가스','lscNm':'화명 서비스센터','tel':'1544-0009','addr':'북구 화명대로 90. 2층'}
			,{'LAT':35.1850434,'LNG':129.0700912,'lsc':'C014','bpname':'부산도시가스','lscNm':'거제 서비스센터','tel':'1544-0009','addr':'연제구 해맞이로 121-1(거제동)'}
			,{'LAT':35.1612553,'LNG':129.156759,'lsc':'C015','bpname':'부산도시가스','lscNm':'우동 서비스센터','tel':'1544-0009','addr':'해운대구 구남로 12번길 60'}
			,{'LAT':35.1578215,'LNG':129.180815,'lsc':'C016','bpname':'부산도시가스','lscNm':'부산 16 지역 관리소','tel':'1544-0009','addr':'해운대구 중2동 1492-15 2층'}
			,{'LAT':35.1680873,'LNG':129.1710644,'lsc':'C017','bpname':'부산도시가스','lscNm':'좌동 서비스센터','tel':'1544-0009','addr':'해운대구 좌동로 14번길 37(중동,2층)'}
			,{'LAT':35.1131003,'LNG':129.0236263,'lsc':'C018','bpname':'부산도시가스','lscNm':'대신 서비스센터','tel':'1544-0009','addr':'서구 보동길 271'}
			,{'LAT':35.2091548,'LNG':129.0691313,'lsc':'C019','bpname':'부산도시가스','lscNm':'온천 서비스센터','tel':'1544-0009','addr':'동래구 충렬대로 75번길 15. 1층'}
			,{'LAT':35.1976058,'LNG':129.0953192,'lsc':'C020','bpname':'부산도시가스','lscNm':'동래연제 서비스센터','tel':'1544-0009','addr':'부산광역시 동래구 낙민동 13-6 에스빼랑스 빌딩 6층'}
			,{'LAT':35.1548025,'LNG':129.0123487,'lsc':'C021','bpname':'부산도시가스','lscNm':'부산 21 지역 관리소','tel':'1544-0009','addr':'사상구 주례동 10-21 (반도보라매머드상가'}
			,{'LAT':35.2471102,'LNG':129.2135218,'lsc':'C022','bpname':'부산도시가스','lscNm':'기장 서비스센터','tel':'1544-0009','addr':'기장군 기장읍 차성로 331. 2층'}
			,{'LAT':35.1237466,'LNG':129.1141905,'lsc':'C023','bpname':'부산도시가스','lscNm':'용호 서비스센터','tel':'1544-0009','addr':'남구 이기대공원로 12번길 11, 2층'}
			,{'LAT':35.2445494,'LNG':129.2221542,'lsc':'C024','bpname':'부산도시가스','lscNm':'부산 24 지역관리소','tel':'1544-0009','addr':'기장군'}
			,{'LAT':36.655604,'LNG':127.475958,'lsc':'D001','bpname':'충청에너지서비스','lscNm':'충청 제1서비스센터','tel':'1599-0009','addr':'충청북도 청주시 청원구 무심동로 634 (내덕동)'}
			,{'LAT':36.608612,'LNG':127.466624,'lsc':'D002','bpname':'충청에너지서비스','lscNm':'충청 제2서비스센터','tel':'1599-0009','addr':'충청북도 청주시 서원구 두꺼비로 35 (산남동)'}
			,{'LAT':36.6213703,'LNG':127.5131438,'lsc':'D003','bpname':'충청에너지서비스','lscNm':'충청 제3서비스센터','tel':'1599-0009','addr':'충청북도 청주시 상당구 용암북로 142 (용암동)'}
			,{'LAT':36.6510436,'LNG':127.4568997,'lsc':'D004','bpname':'충청에너지서비스','lscNm':'충청 제4서비스센터','tel':'1599-0009','addr':'충청북도 청주시 흥덕구 덕암로24번길 41 (봉명동)'}
			,{'LAT':36.614077,'LNG':127.445258,'lsc':'D005','bpname':'충청에너지서비스','lscNm':'충청 제5서비스센터','tel':'1599-0009','addr':'충청북도 청주시 서원구 용호로5번길 26 (죽림동)'}
			,{'LAT':36.9891746,'LNG':127.5984478,'lsc':'D041','bpname':'충청에너지서비스','lscNm':'서부지역서비스센터','tel':'1599-0009','addr':'충청북도 금왕읍 대금로 1498 2층'}
			,{'LAT':37.9891746,'LNG':128.5984478,'lsc':'D051','bpname':'충청에너지서비스','lscNm':'서부지역서비스센터','tel':'1599-0009','addr':'충청북도 금왕읍 대금로 1498 2층'}
			,{'LAT':38.9891746,'LNG':129.5984478,'lsc':'D061','bpname':'충청에너지서비스','lscNm':'서부지역서비스센터','tel':'1599-0009','addr':'충청북도 금왕읍 대금로 1498 2층'}
			,{'LAT':37.1491508,'LNG':128.2240439,'lsc':'D071','bpname':'충청에너지서비스','lscNm':'제천서비스센터','tel':'1599-0009','addr':'충청북도 제천시 장락동 325번지 파라디아아파트 상가동 301-3,301-4호'}
			,{'LAT':36.6213703,'LNG':127.5131438,'lsc':'D081','bpname':'충청에너지서비스','lscNm':'3서비스센터','tel':'1599-0009','addr':'충청북도 청주시 상당구 용암동 2614 2층 360-100'}
			,{'LAT':36.0927738,'LNG':128.4245157,'lsc':'E001','bpname':'영남에너지서비스','lscNm':'제1지역 서비스 센타','tel':'1599-0009','addr':'경상북도 구미시 진평동 179-2 201호'}
			,{'LAT':36.0882866,'LNG':128.3514436,'lsc':'E002','bpname':'영남에너지서비스','lscNm':'제2지역 서비스 센타','tel':'1599-0009','addr':'구미시 상모동 197-4'}
			,{'LAT':36.1392434,'LNG':128.3247556,'lsc':'E003','bpname':'영남에너지서비스','lscNm':'제3지역 서비스 센타','tel':'1599-0009','addr':'경북 구미시 도량동 246-2번지 2층'}
			,{'LAT':36.1357022,'LNG':128.4221769,'lsc':'E004','bpname':'영남에너지서비스','lscNm':'제4지역 서비스 센타','tel':'1599-0009','addr':'구미시 옥계동 746-2 2층'}
			,{'LAT':36.1245688,'LNG':128.359123,'lsc':'E005','bpname':'영남에너지서비스','lscNm':'제5지역 서비스 센터','tel':'1599-0009','addr':'경상북도 구미시 야은로 730 (신평동)3층'}
			,{'LAT':36.1392434,'LNG':128.3247556,'lsc':'E051','bpname':'영남에너지서비스','lscNm':'제3지역 서비스 센타','tel':'1599-0009','addr':'경상북도 구미시 도량동 246-2'}
			,{'LAT':36.0703085,'LNG':129.351779,'lsc':'E061','bpname':'영남에너지서비스','lscNm':'영남에너지서비스','tel':'1599-0009','addr':'경상북도 포항시 북구 소티재로 208 (창포동 586번지)'}
			,{'LAT':37.0703085,'LNG':130.351779,'lsc':'E071','bpname':'영남에너지서비스','lscNm':'영남에너지서비스','tel':'1599-0009','addr':'경상북도 포항시 북구 소티재로 208 (창포동 586번지)'}
			,{'LAT':36.1357022,'LNG':128.4221769,'lsc':'E081','bpname':'영남에너지서비스','lscNm':'영남에너지스비스 문경센터','tel':'1599-0009','addr':'구미시 옥계동 746-2 2층'}
			,{'LAT':36.0418974,'LNG':129.3500958,'lsc':'F001','bpname':'영남에너지서비스','lscNm':'제1서비스센터','tel':'1599-0009','addr':'경상북도 포항시 북구 새마을로 100 (용흥동)'}
			,{'LAT':35.9953347,'LNG':129.350149,'lsc':'F002','bpname':'영남에너지서비스','lscNm':'제2서비스센터','tel':'1599-0009','addr':'경상북도 포상시 남구 연일읍 철강로71번길 60-6'}
			,{'LAT':36.0563226,'LNG':129.3752158,'lsc':'F003','bpname':'영남에너지서비스','lscNm':'제3서비스센터','tel':'1599-0009','addr':'경상북도 포항시 북구 삼호로 189번길 14-7 (항구동)'}
			,{'LAT':36.0165834,'LNG':129.3479589,'lsc':'F004','bpname':'영남에너지서비스','lscNm':'제4서비스센터','tel':'1599-0009','addr':'경상북도 포항시 남구 새천년대로 474번길 14-6 (대잠동)'}
			,{'LAT':36.0544606,'LNG':129.3746673,'lsc':'F011','bpname':'영남에너지서비스','lscNm':'포항 3 지역 관리소','tel':'1599-0009','addr':'경북 포항시 북구 항구동 11-16'}
			,{'LAT':36.0544606,'LNG':129.3746673,'lsc':'F051','bpname':'영남에너지서비스','lscNm':'포항 3 지역 관리소','tel':'1599-0009','addr':'경북 포항시 북구 항구동 11-16'}
			,{'LAT':36.0544606,'LNG':129.3746673,'lsc':'F061','bpname':'영남에너지서비스','lscNm':'포항 3 지역 관리소','tel':'1599-0009','addr':'경북 포항시 북구 항구동 11-16'}
			,{'LAT':34.9541915,'LNG':127.5336442,'lsc':'G001','bpname':'전남도시가스','lscNm':'도시가스 순천서비스센터','tel':'1599-0009','addr':'전라남도 순천시 조례동 1828-7번지 1층'}
			,{'LAT':34.9541915,'LNG':127.5336442,'lsc':'G002','bpname':'전남도시가스','lscNm':'도시가스 2서비스센터','tel':'1599-0009','addr':'전남 순천시 왕궁2길41(조례동)'}
			,{'LAT':34.9349248,'LNG':127.6986202,'lsc':'G003','bpname':'전남도시가스','lscNm':'도시가스 광양서비스센터','tel':'1599-0009','addr':'전라남도 광양시 중동 1759-7번지 2층'}
			,{'LAT':35.2821623,'LNG':127.2920592,'lsc':'G004','bpname':'전남도시가스','lscNm':'도시가스 곡성지사','tel':'1599-0009','addr':'전라남도 곡성군 곡성읍 학교로 13'}
			,{'LAT':35.2821623,'LNG':127.2920592,'lsc':'G005','bpname':'전남도시가스','lscNm':'도시가스 곡성지사(구례)','tel':'1599-0009','addr':'전라남도 곡성군 곡성읍 학교로 13'}
			,{'LAT':34.9421,'LNG':127.6999044,'lsc':'G051','bpname':'전남도시가스','lscNm':'전남 광양1지역관리소','tel':'1599-0009','addr':'전라남도 광양시 중동 1300-2(센터 이전함)'}
			,{'LAT':37.8580617,'LNG':127.7585314,'lsc':'J001','bpname':'강원도시가스','lscNm':'강원 서비스센터','tel':'1599-0009','addr':'강원도 춘천시 동내면 거두리 1060번지 (2층)'}
			,{'LAT':37.8632116,'LNG':127.7333384,'lsc':'J002','bpname':'강원도시가스','lscNm':'강원 서비스센터','tel':'1599-0009','addr':'강원도 춘천시 퇴계동 395-15'}
			,{'LAT':37.8580617,'LNG':127.7585314,'lsc':'J051','bpname':'강원도시가스','lscNm':'강원 서비스센터','tel':'1599-0009','addr':'강원도 춘천시 동내면 거두리 1060번지 (2층)'}
			,{'LAT':37.8865741,'LNG':127.7484031,'lsc':'J061','bpname':'강원도시가스','lscNm':'강원도시가스(주) 영월','tel':'1599-0009','addr':'강원도 춘천시 후평1동 311-8'}
			,{'LAT':37.6909278,'LNG':127.8847825,'lsc':'J100','bpname':'강원도시가스','lscNm':'강원도시가스(주) 홍천사업소','tel':'1599-0009','addr':'강원도 홍천군 홍천읍 신장대리 79-76'}
			,{'LAT':35.9578527,'LNG':126.9658005,'lsc':'K001','bpname':'전북에너지서비스','lscNm':'익산서비스센터','tel':'1599-0009','addr':'전라북도 익산시 신동 813-10번지'}
			,{'LAT':35.9578527,'LNG':126.9658005,'lsc':'K002','bpname':'전북에너지서비스','lscNm':'익산서비스센터','tel':'1599-0009','addr':'전라북도 익산시 신동 813-10번지'}
			,{'LAT':35.5806969,'LNG':126.8531666,'lsc':'K051','bpname':'전북에너지서비스','lscNm':'정읍서비스센터','tel':'1599-0009','addr':'전라북도 정읍시 수성동 943-6번지'}
			,{'LAT':1,'LNG':1,'lsc':'B000','bpname':'코원에너지서비스','lscNm':'코원ES 서울 본사','tel':'02-512-2861','addr':'-'}
			,{'LAT':37.549391,'LNG':127.1441929,'lsc':'B043','bpname':'코원에너지서비스','lscNm':'코원ES 강동 3 LSC','tel':'02-442-6391','addr':'강동구 상암로47길 65 (명일동,3층)'}
			,{'LAT':1,'LNG':1,'lsc':'B099','bpname':'코원에너지서비스','lscNm':'코원ES 집단에너지 LSC','tel':'02-512-2861','addr':'-'}
			,{'LAT':1,'LNG':1,'lsc':'B100','bpname':'코원에너지서비스','lscNm':'코원ES 경기지사','tel':'02-512-2861','addr':'-'}
			,{'LAT':1,'LNG':1,'lsc':'B200','bpname':'코원에너지서비스','lscNm':'코원ES 집단에너지','tel':'02-512-2861','addr':'-'}
			,{'LAT':1,'LNG':1,'lsc':'C000','bpname':'부산도시가스','lscNm':'부산 CGC','tel':'1544-0009','addr':'-'}
			,{'LAT':1,'LNG':1,'lsc':'D000','bpname':'충청에너지서비스','lscNm':'충청에너지서비스','tel':'1599-0009','addr':'-'}
			,{'LAT':36.6556061,'LNG':127.4759594,'lsc':'D062','bpname':'충청에너지서비스','lscNm':'진천 2서비스센타','tel':'1599-0009','addr':'충청북도 청주시 상당구 내덕동 781-10번지'}
			,{'LAT':1,'LNG':1,'lsc':'D100','bpname':'충청에너지서비스','lscNm':'충청에너지서비스 (음성)','tel':'1599-0009','addr':'-'}
			,{'LAT':1,'LNG':1,'lsc':'D200','bpname':'충청에너지서비스','lscNm':'충청에너지서비스 (진천)','tel':'1599-0009','addr':'-'}
			,{'LAT':1,'LNG':1,'lsc':'D300','bpname':'충청에너지서비스','lscNm':'충청에너지서비스 (제천)','tel':'1599-0009','addr':'-'}
			,{'LAT':1,'LNG':1,'lsc':'D400','bpname':'충청에너지서비스','lscNm':'충청에너지서비스 (남부)','tel':'1599-0009','addr':'-'}
			,{'LAT':1,'LNG':1,'lsc':'E000','bpname':'영남에너지서비스','lscNm':'영남에너지서비스','tel':'1599-0009','addr':'-'}
			,{'LAT':1,'LNG':1,'lsc':'E091','bpname':'영남에너지서비스','lscNm':'성주 1 서비스센타','tel':'1599-0009','addr':'-'}
			,{'LAT':1,'LNG':1,'lsc':'E100','bpname':'영남에너지서비스','lscNm':'영남에너지서비스 (김천)','tel':'1599-0009','addr':'-'}
			,{'LAT':36.0934965,'LNG':128.3754036,'lsc':'E200','bpname':'영남에너지서비스','lscNm':'영남 상주','tel':'1599-0009','addr':'구미시 공단동 303'}
			,{'LAT':1,'LNG':1,'lsc':'F000','bpname':'영남에너지서비스','lscNm':'포항 CGC','tel':'1599-0009','addr':'-'}
			,{'LAT':1,'LNG':1,'lsc':'G000','bpname':'전남도시가스','lscNm':'전남 CGC','tel':'1599-0009','addr':'-'}
			,{'LAT':1,'LNG':1,'lsc':'G100','bpname':'전남도시가스','lscNm':'전남 광양 관리소(사용 안함)','tel':'1599-0009','addr':'-'}
			,{'LAT':1,'LNG':1,'lsc':'J000','bpname':'강원도시가스','lscNm':'강원 CGC','tel':'1599-0009','addr':'-'}
			,{'LAT':37.6909278,'LNG':127.8847825,'lsc':'J100','bpname':'강원도시가스','lscNm':'강원도시가스(주) 홍천사업소','tel':'1599-0009','addr':'강원도 홍천군 홍천읍 신장대리79-76'}
			,{'LAT':1,'LNG':1,'lsc':'K000','bpname':'전북에너지서비스','lscNm':'전북에너지서비스','tel':'1599-0009','addr':'-'}
			,{'LAT':1,'LNG':1,'lsc':'K100','bpname':'전북에너지서비스','lscNm':'전북에너지서비스 (정읍)','tel':'1599-0009','addr':'-'}];
			setAlopexCookie('lscDB2',JSON.stringify(ss));
			setAlopexCookie('lscDB_Ver',lscVer);
			for(var i=0;i<ss.length;i++){
				setAlopexCookie(ss[i].lsc,JSON.stringify(ss[i]));
			}
			contiLogin();
		}else{
			contiLogin();
		}
	}
	
	var nowPGCode = '';

	/**
	 * HTML타이틀 생성
	 * @param nm
	 */
	function TITLE(nm){
		document.write('<title>'+nm+' &gt; 스마트 도시가스 3.0 | SK E&amp;S</title>');
	}
	
	/**
	 * HTML상단 래더 생성 - 모두
	 * @param nm
	 */
	function HEADER(nm){
		document.write('<div id="header">');
		document.write('<h1 class="title"><a href="#">'+nm+'</a></h1>');
		document.write('<p class="btn_home"><button id="button_home">홈으로</button></p>');
		document.write('<p class="btn_set"><button id="button_set">설정</button></p>');
		document.write('</div>');
	}
	
	/**
	 * HTML 상단 해더 생성 - 일부
	 * @param nm
	 */
	function HEADER_NONE(nm){
		document.write('<div id="header">');
		document.write('<h1 class="title"><a href="#">'+nm+'</a></h1>');
		//document.write('<p class="btn_home"><button id="button_home">홈으로</button></p>');
		//document.write('<p class="btn_set"><button id="button_set">설정</button></p>');
		document.write('</div>');
	}
	
	/**
	 * HTML 상단 해더 생성 - 일부
	 * @param nm
	 */
	function HEADER_NO_MEMBER(nm){
		document.write('<div id="header">');
		document.write('<h1 class="title"><a href="#">'+nm+'</a></h1>');
		document.write('<p class="btn_noUsrHome"><button id="button_home">홈으로</button></p>');
		//document.write('<p class="btn_set"><button id="button_set">설정</button></p>');
		document.write('</div>');
	}
	
	/**
	 * HTML 상단 해더 생성 - 일부
	 * @param nm
	 */
	function HEADER_BACK(nm){
		document.write('<div id="header">');
		document.write('<h1 class="title"><a href="#">'+nm+'</a></h1>');
		document.write('<p class="btn_back"><button id="button_back">뒤로가기</button></p>');
		//document.write('<p class="btn_set"><button id="button_set">설정</button></p>');
		document.write('</div>');
	}
	
	/**
	 * 사용안함
	 */
//	$a.navigate.setup({
//    	url : function(url, param){
//    		return '../'+ url +'.html';
//    	}
//    });
	
	// getMnpgIngo APP_ID = SCGC

	/**
	 * 페이지 공통 함수
	 */
	function setDefault(){
		$('.btn_home').click(function(){
			//$a.navigate('MN/MMNPG0M0');
			//navigateBackTo('MMNPG0M0');
			navigateBackToNaviGo('MMNPG0M0');
//			navigateGo('MMNPG0M0');
//			navigation.backTo('MMNPG0M0');		
		});
		
		$('.btn_noUsrHome').click(function(){
			//$a.navigate('MN/MMNPG0M0');
			//navigateBackTo('MMNPG0M0');
			navigateBackToNaviGo('MMNPG1M0');
//			navigateGo('MMNPG0M0');
//			navigation.backTo('MMNPG0M0');		
		});
		
		$('.btn_back').click(function(){
			navigateBackToNaviGo('MBLMG1M0');
		});
		
		$('#button_set').click(function(){
			//$a.navigate('MN/MMNPG0M0');
			navigateBackToNaviGo('MFXUS0M0');
			//pop_error();
		});
		
		$('#pop_recommend').click(function(){
//			last_click_time = new Date().getTime();
    		//e.preventDefault();
//			$('.pop_recommend').bPopup({
//				opacity: 0.6,
//				speed: 300 
//			});
			ChkNVlast_click_time = new Date().getTime();
			if(NVlast_click_time != '' && nowPGCode != 'MMNST0M0' && (ChkNVlast_click_time - NVlast_click_time) < 2000){
				//
				console.log('############### db click!! error');
			}else{
				var subject = "도시가스 App";
				var text = "https://goo.gl/dq31Ky";
				var title = "도시가스 Application";
				NVlast_click_time = ChkNVlast_click_time; 
				jsniCaller.invoke("SocialSharing.share",subject,text,title,"shareCallback");
			}
    	});
    	
    	try{
	    	chkSelfTest();
    	}catch(e){
    	}
	}
	
	/**
	 * 공유하기 콜백
	 * @param rt
	 */
	function shareCallback(rt){
		logf('share result :: ',rt);
	}

	/**
	 * http 콜백 공통 
	 * 사용안함
	 * @param errorCode
	 * @param errorMessage
	 */
	function httpErrorCallback(errorCode, errorMessage) {
		logf('error');
	}
	
	/**
	 * 전화번호 형태로 변환 01000000000 > 010-0000-0000
	 * @param nm
	 * @returns
	 */
	function viewPhoneNM(nm){
		if(nm == undefined){
		}else{
			return ascPhoneNM(nm.replace(/(^01.{1})([0-9]+)([0-9]{4})/,"$1-$2-$3"));
		}
	}
	
	function viewPhoneNMJoin(nm){
		if(nm == undefined){
		}else{
			return nm.replace(/(^01.{1})([0-9]+)([0-9]{4})/,"$1-$2-$3");
		}
	}
	
	/**
	 * 전화번호 부분 가림 함수 010-0**0-0000
	 * @param nm
	 * @returns {String}
	 */
	function ascPhoneNM(nm){
		return nm.substring(0,nm.indexOf('-')+2)+'**'+nm.substring(nm.lastIndexOf('-')-1);
	}
	
	/**
	 * 전화번호 - 제거
	 * @param nm
	 * @returns
	 */
	function codePhoneNM(nm){
		return nm.replace('-','').replace('-','');
	}
	
	/**
	 * Alopex Page 이동 1
	 * @param pid
	 */
	function navigateGo(pid){
		if(device.osName == 'iOS'){
			navigateBackToNaviGo(pid);
		}else{
			navigateGo(pid,'',true);
		}
	}
	
	/**
	 * Alopex Page 이동 2
	 * @param pid
	 * @param parameters
	 */
	function navigateGo(pid, para){
		if(device.osName == 'iOS'){
			navigateBackToNaviGo(pid,para);
		}else{
			navigateGo(pid,para,true);
		}
	}
	
	/**
	 * Alopex Page 이동 3
	 * @param pid
	 * @param parameters
	 * @param onAutoDismiss
	 */
	var NVlast_click_time = '';
	function navigateGo(pid,para,onAutoDismiss){
//		ChkNVlast_click_time = new Date().getTime();
//		if(NVlast_click_time != '' && nowPGCode != 'MMNST0M0' && (ChkNVlast_click_time - NVlast_click_time) < 2000){
//			//
//			console.log('############### db click!! error');
//		}else{
			var param = {
				pageId : pid,
				parameters : para,
				autoDismiss: onAutoDismiss
			};
			console.log(location.pathname);
//			NVlast_click_time = ChkNVlast_click_time;
			navigation.navigate(param);
//		}
	}
	
	/**
	 * Alopex page이동 ( BacktoOrNavigate )
	 * @param pid
	 */
	function navigateBackToNaviGo(pid){
//		ChkNVlast_click_time = new Date().getTime();
//		if(NVlast_click_time != '' && nowPGCode != 'MMNST0M0' && (ChkNVlast_click_time - NVlast_click_time) < 2000){
//			//
//			console.log('############### db click!! error');
//		}else{
			var param = {
				pageId : pid
			};
//			NVlast_click_time = ChkNVlast_click_time;
			navigation.backToOrNavigate(param);		
//		}
	}
	
	/**
	 * Alopex page이동 ( BacktoOrNavigate )
	 * 사용안함
	 * 최초 이후에는 파라미터 안넘어감 증상으로 사용안함
	 * @param pid
	 * @param para
	 */
	function navigateBackToNaviParamGo(pid, para){
//		ChkNVlast_click_time = new Date().getTime();
//		if(NVlast_click_time != '' && nowPGCode != 'MMNST0M0' && (ChkNVlast_click_time - NVlast_click_time) < 2000){
//			//
//			console.log('############### db click!! error');
//		}else{
			var param = {
				pageId : pid,
				parameters : para
			};
//			NVlast_click_time = ChkNVlast_click_time;
			navigation.backToOrNavigate(param);
//		}
	}
	
	/**
	 * 현재 년월 가져오기 201504
	 * @returns
	 */
	function getYearMonth(){
		var now = new Date();
		var twoDigitMonth = ((now.getMonth().length+1) == 1)?(now.getMonth()+1) : '0'+(now.getMonth()+1);
		return now.getFullYear()+twoDigitMonth;
	}
	
	/**
	 * 이전 년월 가져오기 201503
	 * @returns
	 */
	function getYearBeforeMonth(){
		var now = new Date();
		var bMonth = new Date(now.getFullYear(), now.getMonth()-1, now.getDate());
		var twoDigitMonth = ((bMonth.getMonth().length+1) == 1)?(bMonth.getMonth()+1) : '0'+(bMonth.getMonth()+1);
		return bMonth.getFullYear()+twoDigitMonth;
	}
	
	/**
	 * 20150404 > 2015.04.04 변환
	 * @param dt
	 * @returns {String}
	 */
	function toDateAddDot(dt){
		return dt.substring(0,4)+'.'+dt.substring(4,6)+'.'+dt.substring(6,8);
	}
	
	function toDateHangul(dt){
		return String(Number(dt.substring(4,6)))+'월 '+String(Number(dt.substring(6,8)))+'일';
	}
	
	/**
	 * 자가 검침 날짜 형식 생성 > 2015.05.05 ~ 05.08
	 * @param dt1
	 * @param dt2
	 * @returns {String}
	 */
	function toMEDate(dt1,dt2){
		return toDateAddDot(dt1)+' ~ '+dt2.substring(4,6)+'.'+dt2.substring(6,8);
	}
	
	/**
	 * 숫자를 화패 단위로 변경
	 * @param nm
	 * @returns
	 */
	function chgNumberToMoney(nm){
		return String(nm).replace(/(\d)(?=(\d{3})+(?!\d))/g, "$1,");
	}
	
	/**
	 * 20150530 > 5.30(토)
	 * @param dt
	 * @returns {String}
	 */
	function getMonthDayDOW(dt){
		var dd = new Date(makeDateFormat(dt));
		var week = new Array('(일)','(월)','(화)','(수)','(목)','(금)','(토)');
		return (dd.getMonth()+1)+'.'+dd.getDate()+(week[dd.getDay()]);
	}
	
	/**
	 * D-Day 구하기 (오늘기준)
	 * @param dt
	 * @returns {Number}
	 */
	function getDDay(dt){
		logf('###################################################');
		logf(dt);
		logf(makeDateFormat(dt));
		var dd = new Date(makeDateFormat(dt));
		logf(dd.getTime());
		var now = new Date();
		logf(now.getTime());
		var gap = dd.getTime() - now.getTime();
		logf(gap);
		var rtDay = Math.floor(gap / (1000 * 60 * 60 * 24)+1);
		logf(rtDay);
		return (rtDay==0?'마감일':'D-'+rtDay);
	}
	
	/**
	 * 사용자 이름 암호화
	 * @param nm
	 * @returns {String}
	 */
	function ascUserNM(nm){
		//console.log('nm.length',nm.length);
		if(nm.length < 5){ // 4자
			return nm.substring(0,1)+'*'+nm.substring(nm.length-1);
		}else{	// 5자 이상
			var rtStr = '';
			rtStr += nm.substring(0,2);
			for(var i=0;i<(nm.length-4);i++){
				rtStr += '*';
			}
			rtStr += nm.substring(nm.length-2);
			return rtStr;
		}
		
	}
	
	/**
	 * 상단 BP로고 가져오기
	 * @returns
	 */
	function getTitleBp(){
		var mbp = getMainBP();
    	var bpInfo = JSON.parse(getAlopexCookie(mbp));
//    	var rtStr = '';
    	var bpLogo = [];
    	bpLogo[0] = '<h2 class="ko-one"><a href="#">코원에너지서비스 | SK E&amp;S</a></h2>';
    	bpLogo[1] = '<h2 class="bs"><a href="#">부산도시가스 | SK E&amp;S</a></h2>';		
    	bpLogo[2] = '<h2 class="ch"><a href="#">충청에너지서비스 | SK E&amp;S</a></h2>';		
    	bpLogo[3] = '<h2 class="gumi"><a href="#">영남에너지서비스(구미) | SK E&amp;S</a></h2>';		
    	bpLogo[4] = '<h2 class="gw"><a href="#">강원도시가스 | SK E&amp;S</a></h2>';		
    	bpLogo[5] = '<h2 class="jb"><a href="#">전북에너지서비스 | SK E&amp;S</a></h2>';		
    	bpLogo[6] = '<h2 class="jn"><a href="#">전남도시가스 | SK E&amp;S</a></h2>';		
    	bpLogo[7] = '<h2 class="pohang"><a href="#">영남에너지서비스(포항) | SK E&amp;S</a></h2>';
    	
    	if(bpInfo.bpname == '코원에너지서비스'){
    		return bpLogo[0];
    	}else if(bpInfo.bpname == '부산도시가스'){
    		return bpLogo[1];
    	}else if(bpInfo.bpname == '충청에너지서비스'){
    		return bpLogo[2];
    	}else if(bpInfo.bpname == '영남에너지서비스'){
    		return bpLogo[3];
    	}else if(bpInfo.bpname == '강원도시가스'){
    		return bpLogo[4];
    	}else if(bpInfo.bpname == '전북에너지서비스'){
    		return bpLogo[5];
    	}else if(bpInfo.bpname == '전남도시가스'){
    		return bpLogo[6];
//    	}else if(bpInfo.bpname == '영남에너지서비스(포항)'){
//    		return bpLogo[7];
    	}
    	 
	}
	
	/**
	 * 메인, 청구서 그래프 그리기시 카테고리 수집용
	 * @param fuqr
	 * @returns {Array}
	 */
    function getCategory(fuqr){
    	var category = [];
    	for(var i=0;i<fuqr.length;i++){
    		category[i] = String(Number(fuqr[i].BUDAT.substring(4)))+'월';
    	}
    	return category;
    }

    /**
     * 메인 그래프 그리기시 자료수집용1
     * @param fuqr
     * @returns {Array}
     */
    function getDatas1(fuqr){
    	var datas = [];
    	for(var i=0;i<fuqr.length;i++){
    		if(getYearBeforeMonth() == fuqr[i].BUDAT){
    			datas[i] = {
    					y : Number(fuqr[i].ABRMENGE.substring(0,fuqr[i].ABRMENGE.indexOf('.'))),
    					color : '#ea002c'
    			};
    		}else{
    			datas[i] = Number(fuqr[i].ABRMENGE.substring(0,fuqr[i].ABRMENGE.indexOf('.')));
    		}
    		
    	}
    	return datas;
    }
    
    /**
     * 청구서 그래프 그리기시 자료수집용1
     * 입력월에 색칠
     * @param fuqr
     * @param nowMonth
     * @returns {Array}
     */
    function getDatas1Month(fuqr,nowMonth){
    	var datas = [];
    	for(var i=0;i<fuqr.length;i++){
    		if(nowMonth == fuqr[i].BUDAT){
    			datas[i] = {
    					y : Number(fuqr[i].ABRMENGE.substring(0,fuqr[i].ABRMENGE.indexOf('.'))),
    					color : '#ea002c'
    			};
    		}else{
    			datas[i] = Number(fuqr[i].ABRMENGE.substring(0,fuqr[i].ABRMENGE.indexOf('.')));
    		}
    		
    	}
    	return datas;
    }
    
    /**
     * 메인, 청구서 그래프 그리기시 자료수집용2
     * @param fuqr
     * @returns {Array}
     */
    function getDatas2(fuqr){
    	var datas = [];
    	for(var i=0;i<fuqr.length;i++){
    		datas[i] = Number(fuqr[i].ABRMENGE.substring(0,fuqr[i].ABRMENGE.indexOf('.')));
    	}
    	return datas;
    }
    
    /**
     * 날짜 20150505 또는 201505인 경우 1505 형태로 변환
     * YY.MM으로 변환
     * @param dt
     * @returns {String}
     */
    function chgDate6And8to4(dt){
    	var rt = dt.substring(2,4)+'.'+dt.substring(4,6);
    	return rt;
    }
    
    /**
     * 프로그래스바 보임
     */
    function showProgressBar(){
    	var option = {
    			"message" : "화면을 불러오는 중입니다.",
    			"cancelable" : false
    	};
    	
    	platformUIComponent.showProgressDialog(option);
    }
    
    /**
     * 프로그래스바 메시지 추가
     * @param msg
     */
    function showProgressBarMsg(msg){
    	var option = {
    			"message" : msg,
    			"cancelable" : false
    	};
    	
    	platformUIComponent.showProgressDialog(option);
    }
    
    /**
     * 프로그래스바 숨김
     */
    function hideProgressBar(){
    	platformUIComponent.dismissProgressDialog();
    }
    
    /**
     * 사용안함
     * @param pr
     * @returns
     */
    function getParamBot(pr){
    	var isRuntime = true;
    	if(isRuntime){
    		return navigation.parameters;
    	}else{
    		return pr;
    	}
    }
    
    /**
     * 오늘이 입력된 날짜를 넘었는지 체크
     * @param dt
     * @returns {Boolean}
     */
    function isChkEnd(dt){
    	var now = new Date();
    	now.setDate(now.getDate() - 1); //당일로 조회하면 기간만료현상이 있어 1일전으로 조회
    	var dd = new Date(makeDateFormat(dt));

    	if(dd > now){
    		return false;
    	}else{
    		return true;
    	}
    }
    
    function makeDateFormat(dt){
	    var yy = dt.substring(0,4);
	    var mm = dt.substring(4,6);
	    var dd = dt.substring(6,8);
//	    if(device.osName == 'iOS'){
//	    	 logf(Number(mm)+"/"+Number(dd)+"/"+yy);
	     	return Number(mm)+"/"+Number(dd)+"/"+yy;
//	    }else{
//	     	logf(Number(dd)+"/"+Number(mm)+"/"+yy);
//		    return Number(dd)+"/"+Number(mm)+"/"+yy;
//	    }
	   
	   
    }
    
    /**
     * 고객센터 전화번호 가져오기
     */
    function myCallCenter(){
    	var mbp = JSON.parse(getMainBPCA());
    	var bpInfo = JSON.parse(getAlopexCookie(mbp.regiogroup));
		logf(bpInfo.tel);
		phone.call(bpInfo.tel);
    }
    
    /**
     * 숫자 , 제거
     * @param nm
     * @returns
     */
    function codeMoney(nm){
		return nm.replace(',','').replace(',','').replace(',','');
	}
    
    /**
     * 목록에서 Null 제거
     * @param as
     * @returns {___anonymous9188_9189}
     */
	function removeArrayToNull(as){
		var _arr = {};
		var l = 0;
		for(var k in as){
			if(as[k] != ''){
				_arr[l] = as[k];
				l++;
			}
		}
		return _arr;
	}
	
	/**
	 * 은랭명으로 화면 그리는 기능
	 * @param bnk
	 * @returns {String}
	 */
	function getBankName(bnk){
//		<li class="bank"><strong><img src="../../images/bank_kb.png" alt="국민은행" /> 국민</strong> <span class="floatR">8305-9012-829440</span></li>
//		<li class="bank"><strong><img src="../../images/bank_nh.png" alt="농협은행" /> 농협</strong> <span class="floatR">0149-4564-919436</span></li>
//		<li class="bank"><strong><img src="../../images/bank_wr.png" alt="우리은행" /> 우리</strong> <span class="floatR">452-061452-18-994</span></li>
//		<li class="bank"><strong><img src="../../images/bank_sh.png" alt="신한은행" /> 신한</strong> <span class="floatR">5620-2405-829242</span></li>
//		<li class="bank"><strong><img src="../../images/bank_ibk.png" alt="기업은행" /> 기업</strong> <span class="floatR">595-063269-97-762</span></li>
//		<li class="bank"><strong><img src="../../images/bank_busan.png" alt="부산은행" /> 부산</strong> <span class="floatR">346-92-689457-1</span></li>
		if(bnk == '국민'){
			return '<strong><img src="../../images/bank_kb.png" alt="국민은행" /> 국민</strong>';
		}else if(bnk == '농협'){
			return '<strong><img src="../../images/bank_nh.png" alt="농협은행" /> 농협</strong>';
		}else if(bnk == '우리'){
			return '<strong><img src="../../images/bank_wr.png" alt="우리은행" /> 우리</strong>';
		}else if(bnk == '신한'){
			return '<strong><img src="../../images/bank_sh.png" alt="신한은행" /> 신한</strong>';
		}else if(bnk == '기업'){
			return '<strong><img src="../../images/bank_ibk.png" alt="기업은행" /> 기업</strong>';
		}else if(bnk == '부산'){
			return '<strong><img src="../../images/bank_busan.png" alt="부산은행" /> 부산</strong>';
		}else{
			return '<strong> '+bnk+'</strong>';
		}
	}
	
	/**
	 * 메인, 청구서 그래프 그리기
	 * @param category
	 * @param datas1
	 * @param datas2
	 */
	function drawGraph(category, datas1, datas2){
		$('#chart').highcharts({
			credits: {
				enabled: false
			},
	        chart: {
	            zoomType: 'none' 					// zoom 막기
	        },
	        exporting: {							// export 막기
	        	contextButton: {
	        		enabled : false
	        	},
	        	enabled : false
	        },
	        title: {
	            text:''
	        },
	        xAxis: [{
	            categories: category,
	            crosshair: false
	        }],
	        yAxis: [{ // Primary yAxis
	             labels: {
	                enabled: false //사이드바 가리기
	            }, 
	            title: {
	                text: '',
	                style: {
	                    color: Highcharts.getOptions().colors[1]
	                }
	            },
	            maxPadding : 0.2          		// 그래프 상단 여유 사이즈 정의
	        }],
	        legend: {
	        	enabled: false
	        },
	        plotOptions: {
	        	column: {
	        		color : '#666',			// 바 그래프 색상
	        		enableMouseTracking : false // 툴팁 막기
	        	},
	        	spline: {
	        		color : '#666',			// 라인 그래프 색상정의
	        		dashStyle : 'solid',			// 라인 정의
	        		dataLabels: {
	        			y:-7,
	        			style: {
	        				fontSize : "8px",
	        				color : "#333"
	        			},
	        			format: '{y}',
	        			enabled : true			// 포인트 출력
	        		},
	        		enableMouseTracking : false	// 툴팁 막기
	        	},
	        	series: {
	        		pointWidth : 8				// 선 굵기(기본 20)
	        	}
	        },
	        series: [{
	            name: '',
	            type: 'column',
	            data: datas1
	        }, {
	            name: '',
	            marker: {
	            	radius : 0,
	            	fillColor : '#ffaaff',
	            },
	            type: 'spline',
	            data: datas2
	        }]
	    });
	}
	
	function textGraph(category, datas1, datas2){
		var str = '고객님의 최근 1년간 도시가스 사용량은 ';
		for(var i=0;i<category.length;i++){
			str += category[i]+' '+datas2[i]+'m<sup>3</sup>';
			if(i != (category.length-1)) str += ', ';
		}
		str += ' 입니다.';
		return str;
	}
	
	/**
	 * 로딩바 관련
	 * 페이지 초기 셋팅
	 */
	function settingLoading(){
		
		var $layerPopObj = $('.loading');
		var left=($(window).scrollLeft()+($(window).width()-$layerPopObj.width())/2);
		var top=($(window).scrollTop()+($(window).height()-$layerPopObj.height())/2);
		$layerPopObj.css({'left':left,'padding-top':top,'position':'absolute'});
		$('body').css('position','relative').append($layerPopObj);
	}
	
	/**
	 * 로딩바 관련
	 * 완료시 호출
	 */
	function completLoad(){
		$('#container').show();
    	$('.loading').hide();
	}
	
	/**
	 * 임시
	 * 코원제외 BP사 코드인경우 001로 고정
	 * 세션의 값이 존재 하는경우 우선처리
	 * @returns
	 */
	function getMainBP(){
		var mbps = getAlopexSession('SessionBP');
		if(mbps == 'undefined'){
			var mbp = getAlopexCookie('MainBP');
			logf(mbp);
			if(mbp.indexOf('B') == -1){
				mbp = mbp.substring(0,1)+'001';
			}
			return mbp;
		}else{
			logf(mbps);
			if(mbps.indexOf('B') == -1){
				mbps = mbps.substring(0,1)+'001';
			}
			return mbps;
		}
	}
	
	function getMainBPCA(){
		var bpcas = getAlopexSession('SessionBPCA');
		if(bpcas == 'undefined'){
			var bpca = getAlopexCookie('MainBPCA');
			return bpca;
		}else{
			return bpcas;
		}
	}
	
	function getSelBP(mbp){
		logf(mbp);
		if(mbp.indexOf('B') == -1){
			mbp = mbp.substring(0,1)+'001';
		}
		return mbp;
	}
	
	/**
	 * 숫자 .밑으로 제거
	 * @param uno
	 * @returns
	 */
	function toMypageUSED(uno){
		logf(uno);
		var rt = chgNumberToMoney(uno.substring(0,uno.indexOf('.')));
		return rt;
	}
	
	/**
	 * 열람 미열람 저장
	 * @param bno
	 */
	function saveBillNo(bno){
		var b1 = getAlopexCookie('readBillList');
		ss = b1;
		if(b1 == 'undefined'){
			// 새로 만들기
			var box2List = new Array();
			box2List.push(bno);
			setAlopexCookie('readBillList',box2List.toString());
		}else{
			b1 = b1.split(',');
			var box2List = [];
			//기존것에 추가
			b1.push(bno);
			//중복제거
			$.each(b1, function(i,el){
	    		if($.inArray(el, box2List) === -1) box2List.push(el);
	    	});
			//100겅체크 날리기
			if(box2List.length > 100){
				box2List.shift();
			}
			//세이브
			setAlopexCookie('readBillList',box2List.toString());
		}
	}
	
	/**
	 * 얄림 미열람 조회
	 * @param bno
	 * @returns {String}
	 */
	function chkBillNo(bno){
		//ss = bno;
		var b1 = getAlopexCookie('readBillList');
		if(b1 == 'undefined'){
			return '미열람';
		}else{
			var chkno = 0;
			b1 = b1.split(',');
			$.each(b1, function(i,el){
	    		if(el == bno){
	    			chkno = 1;
	    			return false;
	    		}    		
	    	});
			if(chkno > 0){
				logf('chkno::'+chkno);
				return '';
			}else{
				logf('chkno::'+chkno);
				return '미열람';
			}
		}
	}
	
	/**
	 * null chk
	 * @param value
	 * @returns {Boolean}
	 */
	function isNullCheck(value) {
		if (value == "null" || value == null || value == "" || value == " "
				|| value == undefined || value == "undefined") {
			return true;
		} else {
			return false;
		}
	}
	
	/**
	 * 기간만료 여부 체크
	 * @param e_dt
	 * @param s_dt
	 * @returns {Boolean}
	 */
	function isOverChkDate(e_dt, s_dt){
		if(e_dt == ''){
			return false;
		}else{
			logf('############################');
			logf(e_dt);
			logf(s_dt);
			var edt = new Date(makeDateFormat(e_dt));
			var sdt = new Date(makeDateFormat(s_dt));
			var ndt = new Date();
			ndt.setDate(ndt.getDate() - 1);
			var ndt2 = new Date();
//			ndt2.setDate(ndt2.getDate());
//			var ndt2 = new Date((ndt.getMonth()+1)+'/'+ndt.getDate()+'/'+ndt.getFullYear());
//			logf('edt :'+e_dt+': '+edt.getFullYear()+'-'+(edt.getMonth()+1)+'-'+edt.getDate());
//			logf('sdt :'+s_dt+': '+sdt.getFullYear()+'-'+(sdt.getMonth()+1)+'-'+sdt.getDate());
//			logf('ndt :: '+ndt.getFullYear()+'-'+(ndt.getMonth()+1)+'-'+ndt.getDate());
//			logf('ndt2 :: '+ndt2.getFullYear()+'-'+(ndt2.getMonth()+1)+'-'+ndt2.getDate());
//			console.log(edt.getTime());
//			console.log(ndt.getTime());
			if(edt.getTime() < ndt.getTime()){  // 기간 만료
				logf('기간 만료');
				return false;
			}else if(sdt.getTime() > ndt2.getTime()){	// 기간 이전
				logf('기간 이전');
				return false;
			}else{
				logf('기간 정상');
				return true;
			}
		}
	}
	
	/**
	 * 기간만료 여부 체크 - 비정기
	 * @param e_dt
	 * @param s_dt
	 * @returns {Boolean}
	 */
	function isOverChkDateSpc(e_dt, s_dt, n_dt, lscCd){
		if(e_dt == ''){
			return false;
		}else{
			if(lscCd.substring(0,1) == "B"){	// 코원
				if(n_dt == '20150918'){
					e_dt = '20150918';
				}else if(n_dt == '20150919' || n_dt == '20150920'){
					e_dt = '20150919';
				}else if(n_dt == '20150921'){
					e_dt = '20150920';
				}else{
					return isOverChkDate(e_dt,s_dt);
				}
			}else if(lscCd.substring(0,1) == "C"){		// 부산
				if(n_dt == '20150917' || n_dt == '20150918'){
					e_dt = '20150918';
				}else if(n_dt == '20150919' || n_dt == '20150920'){
					e_dt = '20150919';
				}else if(n_dt == '20150921'){
					e_dt = '20150920';
				}else{
					return isOverChkDate(e_dt,s_dt);
				}
			}else if(lscCd.substring(0,1) == "D"){		// 충청
				if(n_dt == '20150916'){
					e_dt = '20150917';
				}else if(n_dt == '20150917' || n_dt == '20150918'){
					e_dt = '20150918';
				}else if(n_dt == '20150919' || n_dt == '20150920'){
					e_dt = '20150919';
				}else{
					return isOverChkDate(e_dt,s_dt);
				}
			}else if(lscCd.substring(0,1) == "E"){		// 구미
				if(n_dt == '20150918'){
					e_dt = '20150918';
				}else if(n_dt == '20150919' || n_dt == '20150920'){
					e_dt = '20150919';
				}else if(n_dt == '20150921'){
					e_dt = '20150920';
				}else{
					return isOverChkDate(e_dt,s_dt);
				}
			}else if(lscCd.substring(0,1) == "F"){		// 포항
				if(n_dt == '20150916'){
					e_dt = '20150917';
				}else if(n_dt == '20150917'){
					e_dt = '20150918';
				}else if(n_dt == '20150922'){
					e_dt = '20150921';
				}else if(n_dt == '20150923'){
					e_dt = '20150922';
				}else if(n_dt == '20150924'){
					e_dt = '20150923';
				}else{
					return isOverChkDate(e_dt,s_dt);
				}
			}else if(lscCd.substring(0,1) == "G"){		// 전남
				if(n_dt == '20150916'){
					e_dt = '20150917';
				}else if(n_dt == '20150917' || n_dt == '20150918'){
					e_dt = '20150918';
				}else{
					return isOverChkDate(e_dt,s_dt);
				}
			}else if(lscCd.substring(0,1) == "J"){		// 강원
				if(n_dt == '20150916'){
					e_dt = '20150917';
				}else if(n_dt == '20150917' || n_dt == '20150918'){
					e_dt = '20150918';
				}else{
					return isOverChkDate(e_dt,s_dt);
				}
			}else if(lscCd.substring(0,1) == "K"){		// 전북
				if(n_dt == '20150916'){
					e_dt = '20150917';
				}else if(n_dt == '20150917' || n_dt == '20150918'){
					e_dt = '20150918';
				}else{
					return isOverChkDate(e_dt,s_dt);
				}
			}else{
				return false;
			}
			logf('############################');
			logf(e_dt);
			logf(s_dt);
			var edt = new Date(makeDateFormat(e_dt));
			var sdt = new Date(makeDateFormat(s_dt));
			var ndt = new Date();
			ndt.setDate(ndt.getDate() - 1);
			var ndt2 = new Date();
//			ndt2.setDate(ndt2.getDate());
//			var ndt2 = new Date((ndt.getMonth()+1)+'/'+ndt.getDate()+'/'+ndt.getFullYear());
//			logf('edt :'+e_dt+': '+edt.getFullYear()+'-'+(edt.getMonth()+1)+'-'+edt.getDate());
//			logf('sdt :'+s_dt+': '+sdt.getFullYear()+'-'+(sdt.getMonth()+1)+'-'+sdt.getDate());
//			logf('ndt :: '+ndt.getFullYear()+'-'+(ndt.getMonth()+1)+'-'+ndt.getDate());
//			logf('ndt2 :: '+ndt2.getFullYear()+'-'+(ndt2.getMonth()+1)+'-'+ndt2.getDate());
//			console.log(edt.getTime());
//			console.log(ndt.getTime());
			if(edt.getTime() < ndt.getTime()){  // 기간 만료
				logf('기간 만료');
				return false;
			}else if(sdt.getTime() > ndt2.getTime()){	// 기간 이전
				logf('기간 이전');
				return false;
			}else{
				logf('기간 정상');
				return true;
			}
		}
	}
	
	/**
	 * cookie 저장
	 * @param key
	 * @param value
	 */
	function setAlopexCookie(key,value){
		if(key != "CookieList") setCookieList(key);
		if(device.osName != 'iOS'){
			$a.cookie(key,value);
		}else{
			preference.put(key,value);
		}
	}
	
	/**
	 * cookie 로드
	 * @param key
	 * @returns {String}
	 */
	function getAlopexCookie(key){
		if(key != "CookieList") setCookieList(key);
		var rt = '';
		if(device.osName != 'iOS'){
			rt = $a.cookie(key);
			return rt;
		}else{
			rt = preference.get(key);
			if(rt == undefined) rt = "undefined";
			return rt;
		}
	}
	
	/**
	 * session 저장
	 * @param key
	 * @param value
	 */
	function setAlopexSession(key,value){
		if(key != "SessionList") setSessionList(key);
		if(device.osName != 'iOS'){
			$a.session(key,value);
		}else{
			memoryPreference.put(key,value);
		}
	}
	
	/**
	 * session 로드
	 * @param key
	 * @returns {String}
	 */
	function getAlopexSession(key){
		var rt = '';
		if(device.osName != 'iOS'){
			rt = $a.session(key);
			return rt;
		}else{
			rt = memoryPreference.get(key);
			if(rt == undefined) rt = "undefined";
			return rt;
		}
	}
	
	function setSessionList(keyName){
		var b2 = getAlopexSession("SessionList");
		if(b2 == 'undefined'){
			var sessionList = new Array();
			sessionList.push(keyName);
			if(device.osName != 'iOS'){
				$a.session('SessionList',sessionList.toString());
			}else{
				memoryPreference.put('SessionList',sessionList.toString());
			}
		}else{
			b2 = b2.split(',');
			var sessionList = [];
			//기존것에 추가
			sessionList.push(keyName);
			//중복제거
			$.each(b2, function(i,el){
	    		if($.inArray(el, sessionList) === -1) sessionList.push(el);
	    	});
			//세이브
			if(device.osName != 'iOS'){
				$a.session('SessionList',sessionList.toString());
			}else{
				memoryPreference.put('SessionList',sessionList.toString());
			}
		}
	}
	
	function setCookieList(keyName){
		var b2 = getAlopexSession("CookieList");
		if(b2 == 'undefined'){
			var sessionList = new Array();
			sessionList.push(keyName);
			if(device.osName != 'iOS'){
				$a.session('CookieList',sessionList.toString());
			}else{
				memoryPreference.put('CookieList',sessionList.toString());
			}
		}else{
			b2 = b2.split(',');
			var sessionList = [];
			//기존것에 추가
			sessionList.push(keyName);
			//중복제거
			$.each(b2, function(i,el){
	    		if($.inArray(el, sessionList) === -1) sessionList.push(el);
	    	});
			//세이브
			if(device.osName != 'iOS'){
				$a.session('CookieList',sessionList.toString());
			}else{
				memoryPreference.put('CookieList',sessionList.toString());
			}
		}
	}
	
	function killAllSession(){
//		var b2 = getAlopexSession("SessionList");
		var recomendrSS = getAlopexSession('recomendr');
//		b2 = b2.split(',');
//		for(var j=0;j<b2.length;j++){
//			if(b2[j]=='recomendr'){
//				
//			}else{
//				setSessionKill(b2[j]);
//			}
//		}
		memoryPreference.removeAll();
		setAlopexSession('recomendr',recomendrSS);
		setSessionKill("SessionList");
	}
	
	function killAllCookie(){
		var uPhone = getAlopexCookie('uPhone');
		var chkDisablePop = getAlopexCookie('chkDisablePop');
		var change21_20150917 = getAlopexCookie('change21_20150917');
		
//		var b2 = getAlopexSession("CookieList");
	//	var resetFlag = getAlopexCookie("resetFlag150817");
//		if(resetFlag != 'true'){
//			b2 = b2.split(',');
//			for(var j=0;j<b2.length;j++){
////				if(b2[j] == 'uPhone' || b2[j] == 'resetFlag' || b2[j] == 'pushID'){
////					
////				}else{
//					setCookieKill(b2[j]);
////				}
//			}
			preference.removeAll();
			setSessionKill("CookieList");
//			setAlopexCookie("resetFlag150817","true");
			console.log("### clear cookie - complete ###");
			setAlopexCookie('change21_20150917',change21_20150917);
			setAlopexCookie('uPhone',uPhone);
			setAlopexCookie('chkDisablePop',chkDisablePop);
//		}else{
//			console.log("### clear cookie - end ###");
//		}
	}
	
	function killAllExitCookie(){
		var b2 = getAlopexSession("CookieList");
		b2 = b2.split(',');
		for(var j=0;j<b2.length;j++){
			setCookieKill(b2[j]);
		}
		setSessionKill("CookieList");
	}
	
	function setSessionKill(sid){
		console.log("####### kill session ####");
		if(device.osName != 'iOS'){
			$a.session(sid,'undefined');
		}else{
			memoryPreference.put(sid,'undefined');
		}
	}
	
	function setCookieKill(sid){
		console.log("####### kill Cookie ####");
		if(device.osName != 'iOS'){
			$a.cookie(sid,'undefined');
		}else{
			preference.put(sid,'undefined');
		}
	}
	
	/**
	 * trim
	 * @param str
	 * @returns
	 */
	function trim(str){
		str = str.replace(/(^\s*)|(\s*$)/,"");
		return str;
	}
	
	function replaceAll(str, str2, str3){
		str = eval('str.replace(/'+str2+'/gi,str3)');
		return str;
	}
	/**
	 * 로그 출력
	 * @param conV
	 */
	function logf(conV){
//		logfV('SCGC_Mobile',conV);
		console.log(conV);
	}
	function logfV(ti, conV){
		try{
			if(device.osName == 'iOS'){
				log.log(conV);
			}else{
				console.log(conV);
			}
		}catch(e){
			console.log(conV);
		}
	}
	function loge(conV){
//		logeV('SCGC_Mobile',conV);
		console.log(conV);
	}
	function logeV(ti, conV){
		try{
			if(device.osName == 'iOS'){
				log.error(conV);
			}else{
				console.log(conV);
//				console.log(ti);
			}
		}catch(e){
			console.error(conV);
		}
	}
	
	
	
	/**
	 * 공용팝업
	 * HTML 하단에 foot_popup.js 추가해 줘야 동작함
	 * @param tit			타이틀					string
	 * @param cont			내용					string
	 * @param noti			느낌표 표시 여부 결정		boolean
	 * @param modalClose	modal 적용 여부 결정		boolean
	 * @param btnGrp		버튼 여부 				json{name, id, type[0,2]}
	 */
	var notiPopID = "";
	function notiPop(tit,cont,noti,modalClose,btnGrp){
		if(btnGrp==null){
			// no
			$('.btnGrpNotiP2').html('<span class="small"><button class="Button red pNotiP2Ok">확인</button></span>');
		}else{
			// set BTN
			var btnStr = '';
			for(var i=0;i<btnGrp.list.length;i++){
				btnStr += '<span class="small"><button class="Button red'+btnGrp.list[i].type+' '+btnGrp.list[i].id+'">'+btnGrp.list[i].name+'</button></span>';
			}
			$('.btnGrpNotiP2').html(btnStr);
		}
		if(noti){
    		$('#titleNotiP2').addClass('warning');
    	}else{
    		$('#titleNotiP2').removeClass('warning');
    	}
    	$('#titleNotiP2').html(tit);
    	$('#contNotiP2').html(cont);
    	notiPopID = $('.noti_pop').bPopup({
			modalClose: modalClose,
			opacity: 0.6,
			speed: 300, 
		});
    	if(btnGrp==null){
    		$('.pNotiP2Ok').click(function(){
        		//공용
        		notiPopID.close();
        	});
    	}
	}

	/**
	 * 공용 입력 팝업
	 * HTML 하단에 foot_input_popup.js 추가해 줘야 동작함
	 * @param tit			타이틀					string
	 * @param cont			내용						string
	 * @param noti			느낌표 표시 여부 결정		boolean
	 * @param modalClose	modal 적용 여부 결정		boolean
	 */
	var notiInputPopID = "";
	function notiInputPop(tit,cont,noti,modalClose){
		if(noti){
    		$('#titleNotiP3').addClass('warning');
    	}else{
    		$('#titleNotiP3').removeClass('warning');
    	}
    	$('#titleNotiP3').html(tit);
    	$('#contNotiP3').html(cont);
    	notiInputPopID = $('.noti_pop').bPopup({
			modalClose: modalClose,
			opacity: 0.6,
			speed: 300, 
		});
    	
		$('.pNotiP3Ok').click(function(){
    		//공용
			notiInputPopID.close();
    	});
		$('.pNotiP3Cancel').click(function(){
    		//공용
			notiInputPopID.close();
    	});
	}
	
	/**
	 * 편의점 수납 
	 * 2015-07-23일 발행일 이후부터 조회가 가능하기때문에
	 * 해당 일자를 지났는지 검증하는 function
	 * @param cdt 	발행일		string	20150724
	 * @returns {Boolean}
	 */
	function isCBNStart(cdt){
		var ldt = new Date('07/23/2015');
    	var dd = new Date(makeDateFormat(cdt));

    	if(dd >= ldt){
    		return true;
    	}else{
    		return false;
    	}
	}
	
	/**
	 * 점검일인지 여부 체크
	 * 매주 금요일 오후9시 이후에 오류 발생시 점검 공지 보일지 검증
	 * 다음날 세벽 5시 까지 
	 * @returns {Boolean}
	 */
	function isChkDay(){
		var now = new Date();
		
		var month = now.getMonth()+1;
		var day = now.getDate();
		var year = now.getFullYear();
		
		if(year == 2016 && month == 1 && day == 28){
			if(now.getHours() >= 21){	// 9시 이후
				return true;
			}else{
				return false;
			}
		}else if(year == 2016 && month == 1 && day == 29){
			if(now.getHours() < 6){	// 6시 이전
				return true;
			}else{
				return false;
			}
			
		}else if(now.getDay() == 4){	// 목요일
			if(now.getHours() >= 21){	// 9시 이후
				return true;
			}else{
				return false;
			}
		}else{
			return false;
		}
	}
	
	function putGlobalPreference(key, value){
		try{
			globalPreference.put(key, value);
		}catch(e){}
	}
	
	function getGlobalPreference(key){
		try{
			return globalPreference.get(key);
		}catch(e){
			return '';
		}
	}